{
    "drink water": [
        "Reaching for the glass and preparing to take a sip.",
        "Lifting the glass towards the mouth, ready to drink.",
        "Starting to tilt the glass to pour water into the mouth.",
        "Bringing the glass up and getting ready to drink.",
        "Holding the glass and positioning it for a sip.",
        "Beginning to lift the glass and take the first sip.",
        "Preparing to drink by tilting the glass towards the lips.",
        "Starting to raise the glass and aim for the mouth.",
        "Aligning the glass for a drink and beginning the action.",
        "Holding the glass and moving it towards the mouth."
    ],
    "eat meal": [
        "Preparing utensils and getting ready to start eating.",
        "Bringing food to the mouth and preparing the first bite.",
        "Starting to pick up food and position it for eating.",
        "Beginning to take the first bite and chew slowly.",
        "Lifting food to the mouth and preparing to take a bite.",
        "Starting to use utensils and prepare to eat the meal.",
        "Getting ready to consume by positioning food at the mouth.",
        "Beginning the meal by taking the first piece of food.",
        "Preparing the food for the initial bite and starting to eat.",
        "Bringing food to the mouth and initiating the eating process."
    ],
    "brush teeth": [
        "Picking up the toothbrush and applying toothpaste.",
        "Starting to brush by positioning the brush against teeth.",
        "Beginning to move the brush in small, circular motions.",
        "Getting ready to clean teeth by brushing the surface.",
        "Applying toothpaste to the brush and starting the action.",
        "Positioning the brush and starting to clean the teeth.",
        "Initiating the brushing process by placing the brush on teeth.",
        "Starting to brush by moving the brush in circular strokes.",
        "Beginning to clean teeth with a gentle brushing motion.",
        "Preparing to brush by applying toothpaste and positioning the brush."
    ],
    "brush hair": [
        "Picking up the brush and preparing to start.",
        "Positioning the brush near the hair and beginning to stroke.",
        "Starting to move the brush through the hair from the roots.",
        "Beginning to brush by working through the hair in sections.",
        "Holding the brush and starting with the first strokes.",
        "Getting ready to brush by placing the brush in the hair.",
        "Initiating brushing by moving the brush through strands of hair.",
        "Starting to detangle and smooth the hair with the brush.",
        "Positioning the brush and beginning to work through the hair.",
        "Preparing to brush by parting the hair and starting strokes."
    ],
    "drop": [
        "Releasing the object and preparing to let it fall.",
        "Starting to let the object fall from the hand.",
        "Initiating the dropping process by opening the grip.",
        "Allowing the object to fall towards the ground.",
        "Letting go of the object and beginning its descent.",
        "Releasing the item and preparing for it to hit the ground.",
        "Starting to drop by loosening the hold on the object.",
        "Allowing gravity to take effect as the object falls.",
        "Beginning the dropping action by opening the hand.",
        "Releasing and starting the fall of the object."
    ],
    "pick up": [
        "Reaching down and preparing to grasp the object.",
        "Starting to lift the object off the surface.",
        "Beginning to lift and hold the object firmly.",
        "Grasping the object and preparing to raise it.",
        "Starting to pick up by closing the hand around the item.",
        "Initiating the lift by grasping the object and pulling up.",
        "Reaching for the object and beginning to lift it.",
        "Preparing to pick up by closing fingers around the item.",
        "Starting the process of lifting the object from the ground.",
        "Reaching and grasping to pick up the object."
    ],
    "throw": [
        "Preparing to release the object and aim.",
        "Starting to move the arm back for the throw.",
        "Initiating the throwing motion by moving the arm forward.",
        "Releasing the object with a flick of the wrist.",
        "Aiming and preparing to throw by positioning the arm.",
        "Starting to propel the object through the air.",
        "Throwing the object by extending the arm forward.",
        "Initiating the throw with a swift arm movement.",
        "Preparing to release the object and complete the throw.",
        "Starting to launch the object with a throwing motion."
    ],
    "sit down": [
        "Positioning yourself and preparing to lower into the seat.",
        "Starting to bend the knees and lower the body.",
        "Initiating the sitting motion by easing into the chair.",
        "Beginning to lower yourself and settle into the seat.",
        "Adjusting the position and preparing to sit down.",
        "Moving to sit by bending and lowering towards the seat.",
        "Starting to ease into a sitting position.",
        "Initiating the sitting process by guiding yourself to the seat.",
        "Preparing to sit by adjusting your posture and lowering.",
        "Lowering yourself into the seat and adjusting for comfort."
    ],
    "stand up": [
        "Preparing to rise by shifting weight to the feet.",
        "Starting to straighten the legs and lift the body.",
        "Initiating the standing motion by pushing off the seat.",
        "Beginning to rise and align the body upright.",
        "Shifting position and preparing to stand from the seated state.",
        "Starting to lift yourself up and transition to a standing posture.",
        "Preparing to stand by moving from a seated to an upright position.",
        "Initiating the stand by straightening and lifting the body.",
        "Beginning to rise from the seat and align the body.",
        "Adjusting posture and starting to stand up from a sitting position."
    ],
    "clapping": [
        "Bringing hands together and preparing to create sound.",
        "Starting to bring hands into contact with each other.",
        "Initiating clapping by striking hands together with a rhythm.",
        "Beginning to create applause by pressing palms together.",
        "Moving hands together and preparing for the clapping sound.",
        "Starting to clap by bringing hands together forcefully.",
        "Initiating the clapping action with rhythmic hand contact.",
        "Preparing to create a clapping sound by striking hands.",
        "Beginning to applause by bringing hands together in sync.",
        "Creating the first claps by bringing hands together."
    ],
    "reading": [
        "Opening the book and adjusting the position for a clear view.",
        "Starting to focus on the text, scanning from left to right.",
        "Initial glance at the page, setting up for deeper engagement.",
        "Briefly examining the cover and flipping to the first page.",
        "Beginning to track the lines of text with your eyes.",
        "Aligning the book at a comfortable reading angle.",
        "Adjusting lighting to ensure visibility of the text.",
        "Placing the book in a stable position before starting.",
        "Starting to process the initial words of the text.",
        "Opening the book and preparing to read the introduction."
    ],
    "writing": [
        "Holding the pen and positioning it over the paper.",
        "Beginning to make the first mark on the paper.",
        "Adjusting the hand grip to ensure comfortable writing.",
        "Placing the pen on the page and starting the initial stroke.",
        "Setting up the pen and paper for the first written word.",
        "Starting with the first few letters or words on the paper.",
        "Aligning the pen to begin writing with clarity.",
        "Opening the notebook and preparing to write the first line.",
        "Initial contact of the pen with the paper, marking the start.",
        "Adjusting posture and grip to commence writing."
    ],
    "tear up paper": [
        "Grabbing the paper and preparing to tear it.",
        "Starting to make the initial tear on the edge.",
        "Holding the paper firmly before beginning to rip.",
        "Beginning to pull the paper apart from the corner.",
        "Making the first jagged tear along the edge of the sheet.",
        "Aligning the paper for an even start to tearing.",
        "Starting to separate the paper with initial force.",
        "Preparing the paper and making the first tear.",
        "Initiating the tearing action by grasping the paper.",
        "Holding the edges and beginning the tear process."
    ],
    "put on jacket": [
        "Picking up the jacket and preparing to put it on.",
        "Sliding arms into the sleeves, starting with the right arm.",
        "Adjusting the jacket onto shoulders, aligning the sleeves.",
        "Beginning to wear the jacket by putting one arm through.",
        "Holding the jacket open and preparing to wear it.",
        "Starting to place the jacket over shoulders.",
        "Positioning the jacket for proper arm entry.",
        "Pulling the jacket over arms and aligning it on the body.",
        "Initial movement of slipping arms into the jacket.",
        "Adjusting the jacket to fit correctly on the shoulders."
    ],
    "take off jacket": [
        "Unbuttoning or unzipping the jacket to start removal.",
        "Starting to pull the jacket off from the shoulders.",
        "Slipping arms out of the sleeves to remove the jacket.",
        "Beginning to lift the jacket from the shoulders.",
        "Grasping the jacket and initiating the removal process.",
        "Removing the jacket by pulling it away from the body.",
        "Starting to slide the jacket off by the sleeves.",
        "Unfastening and starting to take off the jacket.",
        "Lifting the jacket off the shoulders and arms.",
        "Initiating the process of removing the jacket from the body."
    ],
    "put on a shoe": [
        "Picking up the shoe and preparing to wear it.",
        "Sliding foot into the shoe and adjusting for fit.",
        "Aligning the shoe with the foot to begin putting it on.",
        "Beginning to insert foot into the shoe’s opening.",
        "Positioning the shoe and starting to place foot inside.",
        "Starting to adjust the shoe on the foot for a snug fit.",
        "Holding the shoe and preparing to place it on the foot.",
        "Sliding foot into the shoe and adjusting it comfortably.",
        "Beginning the process by inserting foot into the shoe.",
        "Aligning and putting the shoe onto the foot."
    ],
    "take off a shoe": [
        "Unfastening any straps or laces before removal.",
        "Starting to pull the shoe off the foot.",
        "Sliding the foot out of the shoe with initial movement.",
        "Beginning to remove the shoe by grasping the heel.",
        "Lifting the shoe off the foot and preparing for removal.",
        "Starting the process by unfastening and pulling off the shoe.",
        "Removing the shoe by sliding foot out carefully.",
        "Grasping the shoe and initiating the removal process.",
        "Taking off the shoe by pulling it away from the foot.",
        "Unfastening and sliding the shoe off the foot."
    ],
    "put on glasses": [
        "Picking up the glasses and preparing to wear them.",
        "Starting to place the glasses on the bridge of the nose.",
        "Adjusting the glasses to fit comfortably on the ears.",
        "Beginning to align the glasses with the eyes.",
        "Placing the glasses on the face and adjusting for fit.",
        "Sliding the glasses onto the nose and adjusting the frames.",
        "Positioning the glasses and starting to wear them.",
        "Starting to put the glasses on by positioning them correctly.",
        "Adjusting the glasses on the face to ensure proper fit.",
        "Wearing the glasses by placing them over the eyes."
    ],
    "take off glasses": [
        "Grasping the glasses and preparing to remove them.",
        "Starting to lift the glasses off the nose and face.",
        "Removing the glasses by sliding them off the ears.",
        "Beginning to take off the glasses by holding the frames.",
        "Unhooking the glasses from the ears and lifting them away.",
        "Starting to remove the glasses by pulling them off gently.",
        "Taking off the glasses by lifting them from the face.",
        "Grasping the frames and removing the glasses carefully.",
        "Sliding the glasses off the face and setting them aside.",
        "Starting to remove the glasses by gently pulling them off."
    ],
    "put on a hat/cap": [
        "Picking up the hat or cap and preparing to wear it.",
        "Placing the hat or cap on the head, adjusting for fit.",
        "Starting to position the hat or cap on the head.",
        "Aligning the hat or cap with the head before putting it on.",
        "Beginning to wear the hat or cap by placing it on top.",
        "Adjusting the fit of the hat or cap as you place it on.",
        "Starting to put on the hat by aligning it properly.",
        "Sliding the hat or cap onto the head and adjusting it.",
        "Placing the hat or cap securely on the head.",
        "Beginning to wear the hat or cap and adjusting it for comfort."
    ],
    "take off a hat/cap": [
        "Reaching up to the hat and starting to lift it off.",
        "Beginning to remove the cap by gripping the brim.",
        "Starting to pull the hat away from the head.",
        "Initiating the removal of the hat by grasping its edge.",
        "Preparing to take off the cap by lifting it upwards.",
        "Starting to peel off the hat and move it away.",
        "Reaching for the hat and beginning the removal process.",
        "Grasping the cap and starting to pull it off the head.",
        "Beginning to take off the hat by loosening its hold.",
        "Preparing to remove the hat and starting the lifting motion."
    ],
    "cheer up": [
        "Beginning to smile and lift your spirits.",
        "Starting to show a more positive and upbeat demeanor.",
        "Initiating a change in mood by brightening up.",
        "Preparing to lift your spirits and adopt a cheerful attitude.",
        "Starting to brighten up and exhibit a happier expression.",
        "Beginning to cheer up by changing your facial expression.",
        "Initiating a mood shift to a more positive and energetic state.",
        "Preparing to smile and adjust to a more cheerful disposition.",
        "Starting to uplift your mood with a positive attitude.",
        "Beginning to show signs of cheerfulness and optimism."
    ],
    "hand waving": [
        "Starting to move the hand back and forth in greeting.",
        "Initiating a wave by raising the hand and moving it side to side.",
        "Beginning to gesture with the hand in a waving motion.",
        "Preparing to wave by lifting the hand and starting the motion.",
        "Starting to move the hand in a friendly waving gesture.",
        "Initiating a wave by alternating hand movements.",
        "Raising the hand and beginning to wave side to side.",
        "Beginning to create a waving motion with the hand.",
        "Starting to gesture with a wave by moving the hand.",
        "Preparing to wave with a hand movement back and forth."
    ],
    "kicking something": [
        "Reaching out and preparing to make a kicking motion.",
        "Beginning to lift the foot and aim at the object.",
        "Starting to swing the foot towards the object to kick.",
        "Initiating a kick by positioning the foot for impact.",
        "Preparing to strike the object with a kicking motion.",
        "Beginning to raise the foot and target the object for a kick.",
        "Starting to move the foot towards the object to execute a kick.",
        "Initiating the kicking action by aligning the foot with the object.",
        "Preparing to deliver a kick by adjusting foot position.",
        "Beginning to move the foot in a kicking motion towards the object."
    ],
    "reach into pocket": [
        "Starting to move the hand towards the pocket.",
        "Initiating a reach by extending the arm towards the pocket.",
        "Beginning to place the hand into the pocket for retrieval.",
        "Preparing to insert the hand into the pocket to find something.",
        "Reaching towards the pocket and starting to insert the hand.",
        "Beginning the action by moving the hand into the pocket.",
        "Starting to feel inside the pocket for an item.",
        "Initiating the reach by extending the hand into the pocket.",
        "Preparing to access the pocket by placing the hand inside.",
        "Beginning to search within the pocket by inserting the hand."
    ],
    "hopping": [
        "Starting to lift one foot and prepare to jump.",
        "Initiating a hop by springing off the ground with one foot.",
        "Beginning the hopping action by lifting and lowering alternately.",
        "Preparing to hop by pushing off with the feet.",
        "Starting to bounce by moving up and down with each hop.",
        "Initiating a jumping motion by propelling off the ground.",
        "Beginning to lift off the ground in a hopping motion.",
        "Preparing to perform hops by alternating feet off the ground.",
        "Starting to spring into the air with a hopping movement.",
        "Initiating a series of hops by bouncing up and down."
    ],
    "jump up": [
        "Starting to bend the knees and prepare to leap.",
        "Initiating a jump by pushing off the ground with both feet.",
        "Beginning to spring upward by extending the legs.",
        "Preparing to leap by crouching and propelling upwards.",
        "Starting to elevate off the ground with a jumping motion.",
        "Initiating the upward jump by pushing off from the ground.",
        "Beginning to launch into the air with a powerful jump.",
        "Preparing to jump by bending knees and extending upward.",
        "Starting to rise from the ground with a jumping action.",
        "Initiating the leap by generating upward momentum."
    ],
    "phone call": [
        "Starting to dial the number and prepare to speak.",
        "Initiating a call by lifting the phone to your ear.",
        "Beginning the phone call by waiting for the connection.",
        "Preparing to speak as the call is being connected.",
        "Starting to engage in conversation after dialing the number.",
        "Initiating the call by bringing the phone to your ear.",
        "Beginning the phone call by waiting for the other party to answer.",
        "Preparing to talk as the call is established.",
        "Starting to communicate following the call connection.",
        "Initiating the conversation after the call is connected."
    ],
    "play with phone/tablet": [
        "Starting to tap the screen and interact with the device.",
        "Initiating play by scrolling through apps or content.",
        "Beginning to engage with the device by swiping and tapping.",
        "Preparing to use the device by touching the screen.",
        "Starting to manipulate the device with touch gestures.",
        "Initiating interaction by selecting apps or content on the screen.",
        "Beginning to explore the device by using various controls.",
        "Preparing to engage with the device through touch input.",
        "Starting to play with the device by navigating through features.",
        "Initiating use by interacting with the phone or tablet screen."
    ],
    "type on a keyboard": [
        "Starting to position fingers and prepare to type.",
        "Initiating typing by pressing the first key on the keyboard.",
        "Beginning to input text by striking keys in sequence.",
        "Preparing to type by placing fingers on the keys.",
        "Starting to create text by engaging with the keyboard.",
        "Initiating the typing process by hitting keys methodically.",
        "Beginning to type by moving fingers over the keyboard.",
        "Preparing to input information by starting to press keys.",
        "Starting to use the keyboard for text entry.",
        "Initiating typing by touching and pressing the keyboard keys."
    ],
    "point to something": [
        "Extending the arm and directing a finger towards the object.",
        "Raising the hand and pointing with a finger at the target.",
        "Initiating a gesture by extending the arm and pointing.",
        "Beginning to direct attention by pointing at the item.",
        "Starting to point by stretching the arm and focusing on the object.",
        "Reaching out and pointing a finger towards the object.",
        "Initiating the action by aiming the finger at the desired location.",
        "Beginning to indicate the object with a clear pointing gesture.",
        "Extending the arm and directing the finger towards the object of interest.",
        "Preparing to highlight the object by pointing at it."
    ],
    "taking a selfie": [
        "Raising the phone and preparing to capture a self-portrait.",
        "Positioning the camera and getting ready to take the selfie.",
        "Starting to hold the phone out and aim it for a photo.",
        "Beginning the action by framing the shot and holding the camera.",
        "Reaching out with the phone and preparing to snap a selfie.",
        "Initiating the pose by positioning the phone for a self-portrait.",
        "Holding the camera at arm's length and getting ready to take the photo.",
        "Preparing to capture the image by aiming the camera at yourself.",
        "Starting to angle the phone and frame the selfie shot.",
        "Raising the camera and preparing to press the shutter for a selfie."
    ],
    "check time (from watch)": [
        "Raising the wrist and looking at the watch to check the time.",
        "Extending the arm and glancing at the watch for the current time.",
        "Initiating a look at the watch by turning the wrist.",
        "Beginning to check the time by observing the watch face.",
        "Starting to glance at the watch by lifting the wrist.",
        "Raising the arm and focusing on the watch to see the time.",
        "Preparing to check the time by turning the wrist towards you.",
        "Initiating a time check by looking at the watch's display.",
        "Extending the wrist and examining the watch for the current time.",
        "Starting to observe the watch to determine the time."
    ],
    "rub two hands": [
        "Bringing hands together and starting to rub them together.",
        "Placing the hands in contact and initiating a rubbing motion.",
        "Beginning to create friction by rubbing the palms together.",
        "Starting the action by moving the hands back and forth.",
        "Initiating a hand rub by placing palms together and rubbing.",
        "Bringing hands together and beginning a rubbing gesture.",
        "Starting to create warmth by rubbing the hands together.",
        "Initiating the rubbing action with consistent hand movements.",
        "Placing hands together and beginning to rub them vigorously.",
        "Creating friction by rubbing the palms and fingers together."
    ],
    "nod head/bow": [
        "Bowing the head slightly and starting to acknowledge.",
        "Initiating a nod by lowering and raising the head.",
        "Beginning to show agreement by moving the head up and down.",
        "Starting to bow the head and gesture respectfully.",
        "Preparing to nod by tilting the head in acknowledgment.",
        "Beginning a bow by lowering the head slightly.",
        "Initiating the nodding motion with a downward and upward movement.",
        "Starting to demonstrate agreement by nodding the head.",
        "Preparing to bow by inclining the head slightly forward.",
        "Beginning to show respect through a head nod or bow."
    ],
    "shake head": [
        "Starting to move the head from side to side in disagreement.",
        "Initiating a shaking motion by turning the head left and right.",
        "Beginning to show disapproval by shaking the head.",
        "Starting the action by moving the head in a side-to-side motion.",
        "Preparing to indicate 'no' by shaking the head.",
        "Beginning to express disagreement with a head shake.",
        "Initiating a head shake by turning the head from one side to another.",
        "Starting to show a negative response by shaking the head.",
        "Moving the head side to side to indicate refusal or disagreement.",
        "Beginning to shake the head and show a negative reaction."
    ],
    "wipe face": [
        "Starting to use the hand to remove something from the face.",
        "Beginning to rub the face with the palm or fingers.",
        "Initiating the action by wiping the face with a hand.",
        "Starting to clean the face by moving the hand across it.",
        "Preparing to remove moisture or dirt by wiping the face.",
        "Beginning to use a hand to gently wipe the face.",
        "Initiating a face clean by rubbing the skin with the hand.",
        "Starting to clear the face of any substance by wiping.",
        "Using the hand to remove something from the face and clean.",
        "Beginning to wipe the face using a gentle hand motion."
    ],
    "salute": [
        "Raising the hand to the forehead and starting a formal gesture.",
        "Initiating a salute by lifting the hand to the brow.",
        "Beginning to show respect by bringing the hand to the head.",
        "Starting the salute by raising the hand in a military fashion.",
        "Preparing to perform a salute with a hand to the forehead.",
        "Beginning to execute the salute by moving the hand up to the brow.",
        "Initiating the gesture of respect by lifting the hand to the head.",
        "Starting to perform a salute with a precise hand movement.",
        "Raising the hand and beginning the formal salute gesture.",
        "Preparing to show respect by positioning the hand at the forehead."
    ],
    "put palms together": [
        "Bringing the palms of the hands together and pressing them.",
        "Starting the gesture by placing the hands together in front.",
        "Initiating a prayer-like pose by joining the palms.",
        "Beginning to press the palms together and hold the position.",
        "Preparing to create a unified gesture by bringing palms together.",
        "Starting to join the hands and press the palms in front.",
        "Initiating a gesture of reverence by placing palms together.",
        "Bringing the hands together and pressing palms firmly.",
        "Beginning to form a prayer position by joining the palms.",
        "Starting the action by placing the palms together and holding."
    ],
    "cross hands in front": [
        "Bringing the hands to the front and crossing them over each other.",
        "Initiating the gesture by positioning one hand over the other in front.",
        "Starting to cross the arms in front of the body.",
        "Beginning to create a crossed-arm position in front of yourself.",
        "Preparing to cross the hands and hold them in front.",
        "Initiating a crossed-hand position by placing one hand over the other.",
        "Bringing the hands together and crossing them in front of the torso.",
        "Starting to form a crossed-arm gesture by moving hands in front.",
        "Positioning the hands in front and crossing them over each other.",
        "Beginning to create a crossed position by placing hands in front."
    ],
    "sneeze/cough": [
        "Begins with a deep inhalation, followed by a sudden, forceful sneeze or cough.",
        "Starts with a noticeable breath in, leading to an immediate, explosive sneeze or cough.",
        "Commences with a sharp intake of air, resulting in a quick sneeze or cough.",
        "Initiates with a sudden, deep breath that triggers a rapid sneeze or cough.",
        "Kicks off with a sharp inhalation, immediately followed by a forceful sneeze or cough.",
        "The action starts with an abrupt intake of air, culminating in a powerful sneeze or cough.",
        "Begins with a quick breath in, which quickly transitions to a strong sneeze or cough.",
        "A noticeable breath is taken, rapidly leading to an explosive sneeze or cough.",
        "Starts with a deep breath, resulting in a swift and forceful sneeze or cough.",
        "Commences with an intense inhalation, swiftly followed by a powerful sneeze or cough."
    ],
    "staggering": [
        "Begins with a slight wobble, leading to an unsteady and erratic gait.",
        "Starts with a minor loss of balance, causing uneven and staggering steps.",
        "Commences with a subtle shift in weight, resulting in an irregular and shaky walk.",
        "Initiates with noticeable unsteadiness, resulting in erratic and staggering steps.",
        "Kicks off with a small imbalance, evolving into frequent stumbling and swaying.",
        "The action starts with a slight wobble, characterized by inconsistent and unstable steps.",
        "Begins with an unstable movement, causing frequent adjustments and irregular gait.",
        "Starts with a gentle loss of balance, leading to a series of unsteady steps.",
        "Commences with an initial wobble, resulting in a series of erratic and unsteady steps.",
        "Initiates with noticeable instability, featuring an uneven and staggering walk."
    ],
    "falling down": [
        "Begins with a sudden loss of balance, leading to a rapid and uncontrolled fall.",
        "Starts with an abrupt shift in stability, resulting in a swift collapse to the ground.",
        "Commences with a noticeable imbalance, causing an immediate and uncontrolled descent.",
        "Initiates with a sudden drop in control, quickly followed by a fall.",
        "Kicks off with a sudden loss of stability, resulting in a rapid fall to the ground.",
        "The action starts with an unexpected shift in balance, leading to a swift fall.",
        "Begins with an immediate instability, causing a quick and uncontrolled fall.",
        "Starts with a sharp loss of control, rapidly leading to a fall.",
        "Commences with a sudden loss of balance, resulting in a fast collapse.",
        "Initiates with an abrupt imbalance, causing an immediate and rapid descent."
    ],
    "headache": [
        "Begins with a mild, dull ache in the head that gradually intensifies.",
        "Starts with subtle discomfort, which slowly evolves into a pronounced headache.",
        "Commences with a gentle ache in the head, gradually becoming more severe.",
        "Initiates with a steady, low-level pain that grows into a throbbing headache.",
        "Kicks off with a slight discomfort in the head, which intensifies into a noticeable headache.",
        "The action begins with a subtle, growing ache, culminating in a severe headache.",
        "Starts with a mild pain that progressively becomes a significant headache.",
        "Commences with a gradual increase in head discomfort, resulting in a throbbing headache.",
        "Initiates with a low-grade ache in the head, evolving into a more intense headache.",
        "Begins with a soft discomfort, which escalates into a pronounced and throbbing headache."
    ],
    "chest pain": [
        "Begins with a sudden sharp discomfort localized in the chest area.",
        "Starts with an acute, pressing pain in the chest, quickly intensifying.",
        "Commences with a noticeable tightness in the chest that rapidly grows.",
        "Initiates with a sharp, localized pain, becoming more severe in the chest.",
        "Kicks off with a sudden onset of chest pressure, escalating into pronounced pain.",
        "The action begins with an intense, sharp pain localized in the chest area.",
        "Starts with acute discomfort in the chest, rapidly growing in severity.",
        "Commences with a noticeable tightness, evolving into a severe chest pain.",
        "Initiates with a localized sharp pain that becomes more intense in the chest.",
        "Begins with a sudden sharp discomfort in the chest, increasing rapidly."
    ],
    "back pain": [
        "Begins with a steady, dull ache in the back that gradually worsens.",
        "Starts with mild discomfort in the back, which slowly evolves into more severe pain.",
        "Commences with an initial dull ache that becomes more pronounced over time.",
        "Initiates with a gentle discomfort in the back, escalating into significant pain.",
        "Kicks off with a persistent, low-level back ache that intensifies.",
        "The action starts with a subtle back pain that gradually becomes more intense.",
        "Begins with a mild discomfort in the back, evolving into a pronounced ache.",
        "Starts with a steady pain that increases in severity in the back region.",
        "Commences with a slight back pain that builds into a more significant discomfort.",
        "Initiates with a gentle ache in the back that becomes increasingly severe."
    ],
    "neck pain": [
        "Begins with a sharp, localized discomfort in the neck area.",
        "Starts with a gradual buildup of stiffness in the neck, becoming pronounced pain.",
        "Commences with a mild neck discomfort that quickly evolves into severe pain.",
        "Initiates with a dull ache in the neck, which intensifies into sharp pain.",
        "Kicks off with noticeable tightness in the neck, growing into significant pain.",
        "The action begins with a subtle ache in the neck that escalates to severe discomfort.",
        "Starts with an initial mild pain in the neck, which becomes more intense.",
        "Commences with an acute discomfort in the neck area, becoming progressively sharper.",
        "Initiates with a growing stiffness in the neck, evolving into significant pain.",
        "Begins with localized neck discomfort, gradually escalating to pronounced pain."
    ],
    "nausea/vomiting": [
        "Begins with a mild sense of queasiness that gradually intensifies into nausea.",
        "Starts with a subtle discomfort in the stomach, leading to an urge to vomit.",
        "Commences with gentle nausea, which progresses into a more intense urge to vomit.",
        "Initiates with an initial feeling of discomfort, rapidly developing into nausea and vomiting.",
        "Kicks off with a low-level queasiness that evolves into a stronger urge to vomit.",
        "The action starts with mild nausea, which quickly escalates into an episode of vomiting.",
        "Begins with a subtle stomach discomfort that grows into significant nausea.",
        "Starts with an unsettled stomach, culminating in a pronounced urge to vomit.",
        "Commences with an initial feeling of queasiness, leading to more severe vomiting.",
        "Initiates with a mild sense of nausea that progresses into an intense urge to vomit."
    ],
    "fan self": [
        "Begins with a rhythmic hand wave that creates a cooling effect.",
        "Starts with a repetitive hand motion designed to generate airflow.",
        "Commences with a steady back-and-forth hand movement to cool oneself.",
        "Initiates with a consistent hand motion that produces a refreshing breeze.",
        "Kicks off with a rhythmic wave of the hand, resulting in a cooling airflow.",
        "The action starts with a steady hand wave to create a pleasant breeze.",
        "Begins with a back-and-forth hand gesture that generates a cooling effect.",
        "Starts with consistent hand movements that produce a gentle airflow.",
        "Commences with rhythmic hand actions aimed at cooling the face.",
        "Initiates with a regular hand motion, resulting in a refreshing breeze."
    ],
    "punch/slap": [
        "Begins with a sudden, forceful hand strike that lands with impact.",
        "Starts with a quick, powerful hand movement resulting in a punch or slap.",
        "Commences with a sharp hand motion that delivers an immediate impact.",
        "Initiates with a rapid and forceful hand action that results in a punch or slap.",
        "Kicks off with a strong hand strike, causing a pronounced impact.",
        "The action starts with a swift hand movement, delivering a forceful punch or slap.",
        "Begins with an impactful hand strike that lands sharply.",
        "Starts with a quick, intense hand motion leading to a punch or slap.",
        "Commences with a powerful hand strike, resulting in significant impact.",
        "Initiates with a sharp hand action that delivers a forceful punch or slap."
    ],
    "kicking": [
        "The leg swings forward, gathering force for an impactful kick.",
        "The foot moves rapidly, making contact with a noticeable thud.",
        "Momentum builds as the leg extends, delivering a forceful kick.",
        "The kick begins with a quick leg movement, followed by a sharp impact.",
        "The foot accelerates, striking the target with a sudden force.",
        "The kicking action starts with a swift leg motion, culminating in a strong hit.",
        "A rapid leg extension leads to an intense, resonant kick.",
        "The foot propels forward, resulting in a decisive impact.",
        "A fast, powerful leg swing initiates the kicking motion.",
        "The action starts with a buildup of momentum, ending with a significant kick."
    ],
    "pushing": [
        "The hand or body applies force, gradually moving the object.",
        "Pressure builds as the hand or body steadily advances the target.",
        "A firm push begins, with the object gradually shifting position.",
        "The force applied increases, causing the object to move incrementally.",
        "The pushing motion starts gently, intensifying as the object moves.",
        "A steady application of force shifts the object progressively.",
        "The hand or body exerts pressure, leading to a slow but sure movement.",
        "The push initiates with gradual force, culminating in a noticeable shift.",
        "Pressure increases, resulting in a consistent, deliberate movement of the object.",
        "The action begins with a gentle force, building to a decisive push."
    ],
    "pat on back": [
        "A hand gently taps the back, providing a reassuring gesture.",
        "The pat starts softly, concluding with a firm, comforting touch.",
        "The hand makes contact with a brief, encouraging pat on the back.",
        "A quick, gentle touch on the back delivers a supportive pat.",
        "The action begins with a soft pat, followed by a firmer touch.",
        "The hand moves to deliver a warm, brief pat on the back.",
        "A supportive touch starts light and concludes with a more solid pat.",
        "The pat begins with a soft contact, ending in a comforting touch.",
        "A gentle hand tap initiates, concluding with a reassuring pat.",
        "The action starts with a light pat, intensifying to a comforting touch."
    ],
    "point finger": [
        "The finger extends and aims precisely at the intended target.",
        "A sharp gesture begins as the finger extends toward the object.",
        "The pointing action starts with a deliberate extension of the finger.",
        "The finger extends and pauses, directing attention to the specific point.",
        "The motion begins with a clear, purposeful extension of the finger.",
        "A precise finger movement aims steadily at the target.",
        "The finger stretches out, pointing clearly at the desired location.",
        "The pointing gesture starts with an outstretched finger, ending with a firm aim.",
        "A deliberate finger extension directs focus toward the target.",
        "The action initiates with a precise, directed finger point."
    ],
    "hugging": [
        "The arms open wide, moving in to envelop the person in a warm embrace.",
        "The hugging motion begins with arms extending, followed by a gentle encircling.",
        "A full embrace starts with open arms, drawing the person in closely.",
        "The action starts with arms reaching out, concluding with a tender hug.",
        "The hugging gesture initiates with a gradual approach, ending in a close embrace.",
        "Arms extend and wrap around, initiating a comforting, affectionate hug.",
        "The motion starts with open arms, ending in a heartfelt embrace.",
        "The embrace begins with a slow approach, followed by a warm, close hug.",
        "A gentle approach with open arms leads to a full, affectionate hug.",
        "The action starts with extending arms, transitioning into a loving hug."
    ],
    "giving object": [
        "The hand extends forward, presenting the object for the recipient.",
        "The gesture begins with a forward motion, culminating in the object being offered.",
        "The action starts with the hand moving to deliver the item to another.",
        "An object is gradually transferred as the hand reaches out to give it.",
        "The hand moves to present the object, concluding with the hand opening.",
        "The object is offered with a gentle hand extension toward the recipient.",
        "The gesture initiates with a forward reach, ending with the object being handed over.",
        "The action begins with extending the hand, concluding in a careful delivery.",
        "A gradual hand movement leads to the object being passed to another.",
        "The giving gesture starts with an outstretched hand, resulting in a handover."
    ],
    "touch pocket": [
        "The hand moves toward the pocket, initiating contact with a light touch.",
        "A gentle reach results in the hand making contact with the pocket's opening.",
        "The action begins with a hand extending to make a brief touch inside the pocket.",
        "The hand approaches and lightly touches the pocket's edge.",
        "The gesture initiates with a hand reaching and gently making contact with the pocket.",
        "The motion starts with the hand nearing the pocket, resulting in a brief touch.",
        "A slow approach ends with the hand lightly touching or feeling inside the pocket.",
        "The hand extends to make a subtle contact with the pocket's fabric.",
        "The action begins with a careful hand movement, ending in a light touch inside the pocket.",
        "The hand reaches and makes a brief contact with the pocket's opening."
    ],
    "shaking hands": [
        "The hand extends and grasps, initiating a firm handshake.",
        "A hand reaches out, leading to a mutual clasp and shaking motion.",
        "The shaking starts with a firm grasp, followed by a rhythmic shaking gesture.",
        "The handshake begins with hand contact, transitioning to a smooth shake.",
        "The motion starts with extending a hand, ending with a brief shaking interaction.",
        "A handshake is initiated with a firm grip, concluding with a brief shaking motion.",
        "The gesture involves a hand grasping and shaking in a rhythmic pattern.",
        "A hand extends and grips, leading to a short, smooth handshake.",
        "The action starts with hand contact, transitioning to a gentle shaking movement.",
        "The hand reaches out, resulting in a firm grasp and a rhythmic shake."
    ],
    "walking towards": [
        "The movement begins with a deliberate stride in the direction of the target.",
        "The approach starts with steady steps, gradually closing the distance.",
        "Walking begins with purposeful steps aimed at reaching the destination.",
        "The action initiates with a forward motion, leading to a steady approach.",
        "Steps are taken to gradually move closer to the intended target.",
        "The walking action starts with a clear direction, resulting in a gradual approach.",
        "Movement commences with deliberate strides, advancing toward the destination.",
        "A purposeful walk begins, with steps closing the gap to the target.",
        "The action involves steady movement toward the desired location.",
        "The approach starts with a deliberate walk, gradually decreasing the distance."
    ],
    "walking apart": [
        "The separation begins with steady steps moving in opposite directions.",
        "Walking apart initiates with a deliberate stride away from each other.",
        "The action starts with both parties taking steps to increase distance.",
        "Movement begins with clear, opposite strides, gradually creating space.",
        "The walk apart involves steady steps, resulting in a widening gap.",
        "The action begins with deliberate separation, leading to increased distance.",
        "Walking away starts with measured steps, expanding the space between individuals.",
        "The separation commences with coordinated steps in opposite directions.",
        "Steps are taken to gradually increase the distance between individuals.",
        "The action initiates with walking in opposite directions, expanding the space."
    ],
    "put on headphone": [
        "slowly raising headphones towards ears, adjusting for comfort",
        "gradually lifting headphones, ensuring proper fit over the head",
        "carefully placing headphones over ears, securing with gentle pressure",
        "methodically positioning headphones, aligning with ear contours",
        "gently lowering headphones, making small adjustments for sound quality",
        "systematically pulling headphones closer, preparing for a snug fit",
        "softly encasing ears with headphones, checking for tightness",
        "slowly enveloping ears, feeling the cushioning settle in place",
        "deliberately adjusting headphones, ensuring no discomfort occurs",
        "tenderly placing headphones, experiencing the sound isolation effect"
    ],
    "take off headphone": [
        "slowly lifting headphones away from ears, releasing sound",
        "gently pulling headphones back, allowing ears to breathe",
        "carefully removing headphones, feeling the rush of silence",
        "methodically sliding headphones off, reconnecting with surroundings",
        "softly detaching headphones, appreciating ambient sounds returning",
        "systematically easing headphones away, restoring audio balance",
        "deliberately lowering headphones, letting go of sound pressure",
        "tenderly removing headphones, enjoying the freedom of unencumbered hearing",
        "gradually taking off headphones, sensing the transition to quiet",
        "slowly setting down headphones, relishing in the sudden stillness"
    ],
    "shoot at basket": [
        "initially positioning feet, aiming for precision before the shot",
        "deliberately raising the ball, preparing for the release motion",
        "carefully aligning body, focusing intently on the basket's rim",
        "methodically executing the shot, transferring energy from legs to arms",
        "gently releasing the ball, allowing it to arc gracefully towards the hoop",
        "gradually following through, maintaining focus on the basket’s center",
        "tenderly completing the shot, observing the ball's trajectory closely",
        "systematically assessing the outcome, anticipating the ball's landing",
        "softly reacting to the result, adjusting future shots accordingly",
        "slowly transitioning back, readying for the next play or movement"
    ],
    "bounce ball": [
        "initially holding the ball, feeling its weight in the palm",
        "deliberately pressing down, initiating the first bounce towards the ground",
        "gently releasing the ball, watching it rebound upward with energy",
        "methodically controlling the next bounce, timing it with each rise",
        "systematically maintaining rhythm, creating a consistent bouncing pattern",
        "slowly increasing the height, exploring the limits of the bounce",
        "carefully adjusting force, experimenting with softer and harder bounces",
        "tenderly responding to the ball's rhythm, syncing movements effortlessly",
        "deliberately observing the ball's behavior, adapting to its responses",
        "softly concluding the sequence, preparing for the next action"
    ],
    "tennis bat swing": [
        "initially positioning feet, aligning body for the perfect swing",
        "deliberately raising the bat, focusing on the incoming ball",
        "carefully winding up, generating power from the lower body",
        "methodically executing the swing, transferring momentum through the arms",
        "gently connecting with the ball, feeling the impact resonate",
        "slowly following through, ensuring balance and form post-swing",
        "tenderly observing the ball's path, readying for the next shot",
        "systematically adjusting stance, analyzing swing effectiveness",
        "softly preparing for the next rally, maintaining concentration and readiness",
        "deliberately finishing the motion, reflecting on swing precision"
    ],
    "juggle table tennis ball": [
        "initially balancing the first ball, focusing on hand coordination",
        "deliberately tossing the ball upward, anticipating the next move",
        "carefully catching the ball, maintaining rhythm and timing",
        "methodically introducing a second ball, enhancing coordination complexity",
        "gently adding a third ball, challenging hand-eye synchronization",
        "systematically adjusting toss height, ensuring consistent juggling pace",
        "softly reacting to any missed balls, quickly recovering balance",
        "deliberately maintaining focus, emphasizing smooth transitions between catches",
        "tenderly refining technique, exploring new patterns and tricks",
        "slowly concluding the routine, appreciating the flow of movement"
    ],
    "hush": [
        "initially pausing conversations, signaling the need for silence",
        "deliberately lowering voice, communicating the importance of quiet",
        "gently placing a finger on lips, emphasizing the 'hush' gesture",
        "methodically scanning the room, ensuring everyone is attentive",
        "softly encouraging others to quiet down, maintaining a calm demeanor",
        "slowly reinforcing silence, creating a peaceful atmosphere",
        "tenderly maintaining eye contact, deepening the request for hush",
        "systematically observing reactions, adjusting approach as needed",
        "deliberately ensuring the message is clear, fostering cooperation",
        "slowly transitioning back to normal volume, appreciating the silence"
    ],
    "flick hair": [
        "initially brushing hair back, preparing for the flick motion",
        "deliberately raising hands, focusing on the angle of the flick",
        "carefully executing the flick, sending hair cascading away",
        "methodically adjusting body posture, enhancing the flick's elegance",
        "gently following through, feeling the hair settle into place",
        "systematically maintaining confidence, embracing the playful gesture",
        "softly observing reactions, enjoying the attention from the flick",
        "deliberately refining the technique, experimenting with different styles",
        "tenderly embracing the moment, connecting with one's appearance",
        "slowly concluding the gesture, returning to a relaxed stance"
    ],
    "thumb up": [
        "initially positioning hand, preparing to raise the thumb in approval",
        "deliberately lifting the thumb, signaling positive feedback",
        "gently extending the thumb upwards, reinforcing the message",
        "methodically ensuring visibility, drawing attention to the gesture",
        "softly encouraging others, creating an atmosphere of affirmation",
        "systematically observing reactions, adjusting body language as needed",
        "deliberately maintaining eye contact, enhancing the approval signal",
        "tenderly appreciating the moment, feeling the positivity radiate",
        "slowly lowering the hand, concluding the expression of support",
        "carefully reflecting on the interaction, considering future gestures"
    ],
    "thumb down": [
        "initially positioning hand, preparing to lower the thumb in disapproval",
        "deliberately lowering the thumb, clearly indicating a negative response",
        "gently extending the thumb downwards, reinforcing the discontent",
        "methodically ensuring clarity, drawing attention to the gesture",
        "softly expressing dissent, creating a sense of rejection",
        "systematically observing reactions, adjusting stance as needed",
        "deliberately maintaining eye contact, emphasizing the negative signal",
        "tenderly acknowledging the moment, feeling the weight of disapproval",
        "slowly withdrawing the hand, concluding the expression of dissent",
        "carefully reflecting on the interaction, contemplating future responses"
    ],
    "make OK sign": [
        "initially curling fingers, forming a circle with the thumb and index",
        "deliberately positioning hand, emphasizing the gesture with confidence",
        "gently raising the OK sign, showcasing it for clarity",
        "methodically ensuring visibility, inviting acknowledgment from others",
        "tenderly smiling while displaying the sign, enhancing positivity",
        "softly reinforcing the message, feeling assurance in the gesture",
        "systematically observing reactions, adapting the display as needed",
        "carefully maintaining the position, enjoying the moment of approval",
        "gradually connecting with others, creating a sense of agreement",
        "deliberately concluding the gesture, feeling satisfied with the expression"
    ],
    "make victory sign": [
        "initially raising two fingers, creating the V shape confidently",
        "deliberately positioning the hand, showcasing the sign proudly",
        "gently emphasizing the gesture, feeling triumph resonate",
        "methodically holding the sign up, inviting others to join in",
        "tenderly smiling while displaying the victory sign, radiating positivity",
        "softly reinforcing the message of success, feeling energized",
        "systematically observing reactions, gauging the impact of the gesture",
        "carefully maintaining the sign, celebrating shared accomplishments",
        "gradually connecting with others, fostering a sense of victory",
        "deliberately lowering the hand, feeling a sense of achievement"
    ],
    "staple book": [
        "initially aligning pages, preparing for a clean staple connection",
        "deliberately positioning the stapler, ensuring proper placement on the edge",
        "gently pressing down, feeling the mechanism engage with a click",
        "methodically ensuring the staple is secure, checking for stability",
        "tenderly organizing the pages, appreciating the neatness achieved",
        "softly reflecting on the task, feeling satisfaction in completion",
        "systematically preparing for the next book, maintaining a workflow",
        "carefully observing the outcome, ensuring all pages are joined",
        "gradually stacking finished books, preparing for distribution or storage",
        "deliberately concluding the task, enjoying the order created"
    ],
    "counting money": [
        "initially gathering bills, preparing for an organized counting process",
        "deliberately flipping through notes, ensuring each denomination is visible",
        "gently stacking the bills, creating neat piles for clarity",
        "methodically verifying totals, double-checking for accuracy",
        "tenderly feeling the texture of the bills, appreciating their value",
        "softly reflecting on the amounts, noting any discrepancies encountered",
        "systematically adjusting stacks, ensuring everything is in order",
        "carefully organizing coins, sorting by size for efficiency",
        "gradually feeling a sense of accomplishment as totals are confirmed",
        "deliberately concluding the count, feeling satisfaction in precision"
    ],
    "cutting nails": [
        "initially selecting the right tools, preparing for nail trimming",
        "deliberately positioning fingers, ensuring steady grip on the clippers",
        "gently applying pressure, feeling the nail clipper engage smoothly",
        "methodically trimming each nail, maintaining a consistent shape",
        "tenderly observing the results, ensuring neatness and evenness",
        "softly reflecting on self-care, appreciating the fresh look",
        "systematically cleaning up clippings, maintaining a tidy space",
        "carefully checking for any rough edges, smoothing as needed",
        "gradually finishing the task, feeling satisfaction in personal grooming",
        "deliberately concluding the session, enjoying the tidy appearance"
    ],
    "cutting paper": [
        "initially positioning the paper, ensuring a clean cutting edge",
        "deliberately aligning scissors, preparing for a precise cut",
        "gently applying pressure, feeling the blade glide through smoothly",
        "methodically following the lines, ensuring accuracy in the cut",
        "tenderly observing the result, appreciating the clean edges achieved",
        "softly reflecting on the task, feeling a sense of accomplishment",
        "systematically stacking the cut pieces, organizing for future use",
        "carefully cleaning the workspace, ensuring no scraps remain",
        "gradually concluding the cutting process, admiring the neat results",
        "deliberately preparing for the next project, feeling inspired"
    ],
    "snap fingers": [
        "initially positioning fingers, preparing for the snap action",
        "deliberately curling fingers, ensuring a firm grip for snapping",
        "gently flicking the thumb against the middle finger, creating a sharp sound",
        "methodically practicing the motion, aiming for precision in execution",
        "tenderly enjoying the sound, feeling rhythm pulse through the air",
        "softly observing reactions, noting the effect of the snap",
        "systematically incorporating snaps into music, enhancing the beat",
        "carefully maintaining the motion, enjoying the fluidity of movement",
        "gradually inviting others to join, fostering a sense of rhythm",
        "deliberately concluding the sequence, feeling satisfaction in expression"
    ],
    "open bottle": [
        "initially selecting the right opener, preparing for the task",
        "deliberately positioning the opener, ensuring a firm grip on the cap",
        "gently applying pressure, feeling the satisfying pop as it releases",
        "methodically lifting the cap away, ensuring no spills occur",
        "tenderly observing the contents, feeling anticipation for the first sip",
        "softly reflecting on the moment, savoring the excitement of opening",
        "systematically preparing a glass, readying for pouring if desired",
        "carefully checking for any remnants of the cap, maintaining tidiness",
        "gradually transitioning to enjoying the beverage, appreciating the taste",
        "deliberately concluding the opening process, feeling satisfied with the result"
    ],
    "sniff/smell": [
        "initially bringing the object closer, preparing to inhale deeply",
        "deliberately taking a slow breath, allowing scents to fill senses",
        "gently savoring the aroma, letting it evoke memories and feelings",
        "methodically analyzing layers of scent, identifying subtle notes",
        "tenderly reflecting on the experience, appreciating the fragrance",
        "softly observing reactions, noting how the smell affects mood",
        "systematically comparing scents, creating a mental catalog of favorites",
        "carefully adjusting proximity, ensuring an optimal sniffing experience",
        "gradually concluding the moment, feeling content with the exploration",
        "deliberately transitioning back to surroundings, carrying scents in memory"
    ],
    "squat down": [
        "initially positioning feet shoulder-width apart, preparing to lower",
        "deliberately bending knees, engaging muscles for stability",
        "gently lowering the body, feeling the stretch in legs and hips",
        "methodically maintaining balance, ensuring a stable posture",
        "tenderly embracing the position, feeling the connection to the ground",
        "softly reflecting on the moment, appreciating the effort involved",
        "systematically observing surroundings, grounding oneself in the space",
        "carefully preparing to rise again, engaging core muscles for strength",
        "gradually concluding the squat, feeling satisfaction in the stretch",
        "deliberately transitioning to standing, enjoying the release of tension"
    ],
    "toss a coin": [
        "initially gripping the coin tightly, preparing for the toss",
        "deliberately flicking the coin upward, feeling it leave the hand",
        "gently watching it spin, anticipating the outcome as it rises",
        "methodically observing the arc, noting the height achieved",
        "tenderly focusing on the landing, eager for the result",
        "softly reacting to the coin's descent, feeling excitement build",
        "systematically tracking its fall, preparing for the reveal",
        "carefully observing the final position, confirming heads or tails",
        "gradually sharing the result, inviting others to engage",
        "deliberately concluding the toss, feeling satisfaction in the game"
    ],
    "fold paper": [
        "initially selecting the sheet, preparing for a precise fold",
        "deliberately aligning edges, ensuring perfect symmetry in the crease",
        "gently pressing down, feeling the paper give under pressure",
        "methodically creating sharp lines, enhancing the paper's structure",
        "tenderly observing the result, appreciating the neatness achieved",
        "softly reflecting on the task, feeling satisfaction in the outcome",
        "systematically preparing for the next fold, maintaining focus",
        "carefully adjusting for alignment, ensuring perfection with each crease",
        "gradually finishing the task, enjoying the transformation made",
        "deliberately concluding the folding process, feeling a sense of completion"
    ],
    "ball up paper": [
        "initially gathering the sheet, preparing to compress it tightly",
        "deliberately crumpling edges, feeling the texture change beneath fingers",
        "gently shaping it into a sphere, ensuring it holds form",
        "methodically applying pressure, enjoying the satisfying crunching sound",
        "tenderly observing the final shape, appreciating the compactness achieved",
        "softly reflecting on the action, feeling playful and creative",
        "systematically preparing to toss or store the ball, planning ahead",
        "carefully checking for any loose edges, ensuring it’s tightly formed",
        "gradually finishing the task, feeling a sense of accomplishment",
        "deliberately concluding the process, enjoying the playful result"
    ],
    "play magic cube": [
        "initially inspecting the cube, preparing for a strategic twist",
        "deliberately rotating faces, feeling the mechanism click into place",
        "gently aligning colors, focusing on patterns emerging with each turn",
        "methodically planning moves, anticipating the next steps needed",
        "tenderly reflecting on progress, feeling excitement build with each completion",
        "softly observing improvements, appreciating skills sharpened through practice",
        "systematically applying algorithms, enhancing problem-solving abilities",
        "carefully checking for completed sections, enjoying the satisfaction felt",
        "gradually nearing the final solution, feeling tension and thrill rise",
        "deliberately concluding the game, basking in the achievement earned"
    ],
    "apply cream on face": [
        "initially selecting the cream, preparing for a nourishing application",
        "deliberately dispensing a small amount, feeling its texture in hand",
        "gently dotting cream on cheeks, forehead, and chin for even coverage",
        "methodically massaging in, feeling the cream absorb into the skin",
        "tenderly observing the result, appreciating the hydration provided",
        "softly reflecting on self-care, feeling refreshed and rejuvenated",
        "systematically applying to neck, ensuring thorough nourishment",
        "carefully checking for any excess, smoothing for an even finish",
        "gradually enjoying the cooling sensation, feeling revitalized and clean",
        "deliberately concluding the routine, embracing the glow achieved"
    ],
    "apply cream on hand": [
        "initially choosing the cream, preparing for a moisturizing treatment",
        "deliberately dispensing a small amount onto the palm, feeling its richness",
        "gently rubbing hands together, spreading the cream evenly",
        "methodically massaging into skin, ensuring absorption in each area",
        "tenderly observing the softness achieved, appreciating the nourishment",
        "softly reflecting on the experience, feeling comfort in self-care",
        "systematically checking for any dry spots, ensuring full coverage",
        "carefully smoothing the cream into cuticles, enhancing overall appearance",
        "gradually enjoying the silky feel, appreciating the transformation",
        "deliberately concluding the application, feeling satisfied with the result"
    ],
    "put on bag": [
        "initially selecting the bag, preparing for a smooth transition",
        "deliberately positioning the straps over shoulders, feeling the weight settle",
        "gently adjusting for comfort, ensuring a secure fit on the back",
        "methodically checking pockets, making sure essentials are within reach",
        "tenderly observing the bag’s placement, appreciating its utility",
        "softly reflecting on the journey ahead, feeling prepared and organized",
        "systematically ensuring everything is tucked away securely",
        "carefully lifting the bag higher for balance, feeling ready to go",
        "gradually adjusting as needed, ensuring comfort during movement",
        "deliberately concluding the preparation, feeling equipped for the day"
    ],
    "take off bag": [
        "initially reaching for the straps, preparing to lift it off",
        "deliberately loosening the grip, feeling the weight shift",
        "gently lowering the bag to the ground, ensuring a soft placement",
        "methodically adjusting posture, relieving pressure from shoulders",
        "tenderly observing the space created, appreciating the lightness felt",
        "softly reflecting on the day, feeling satisfaction in completion",
        "systematically checking for any items left inside, ensuring nothing is forgotten",
        "carefully placing the bag in a designated spot, maintaining order",
        "gradually enjoying the freedom of movement, feeling unencumbered",
        "deliberately concluding the action, appreciating the relief provided"
    ],
    "put object into bag": [
        "initially selecting the object, preparing for safe storage",
        "deliberately opening the bag, ensuring enough space for the item",
        "gently placing the object inside, feeling satisfaction in organization",
        "methodically checking for additional items, maximizing space efficiently",
        "tenderly ensuring the object is secure, preventing any damage",
        "softly reflecting on the necessity of the item, feeling prepared",
        "systematically organizing the contents, creating a functional layout",
        "carefully zipping or closing the bag, ensuring everything is contained",
        "gradually feeling a sense of accomplishment, knowing all is ready",
        "deliberately concluding the action, feeling equipped for what’s ahead"
    ],
    "take object out of bag": [
        "initially reaching inside, preparing to retrieve the desired item",
        "deliberately searching through contents, ensuring nothing is overlooked",
        "gently lifting the object, feeling its familiar weight in hand",
        "methodically assessing the space left behind, ensuring order remains",
        "tenderly reflecting on the need for the item, feeling its value",
        "softly observing surroundings, preparing to use the object retrieved",
        "systematically checking for anything else needed, ensuring preparedness",
        "carefully placing other items back, maintaining organization in the bag",
        "gradually feeling satisfaction in having what’s needed, ready to proceed",
        "deliberately concluding the action, embracing the moment of use"
    ],
    "open a box": [
        "gradually lifting the lid, anticipation building as it creaks open",
        "deliberately prying apart the edges, feeling excitement swell within",
        "gently peeling back the top, curiosity sparking with each movement",
        "methodically loosening the flaps, ensuring a clean opening achieved",
        "tenderly revealing the contents inside, marveling at what’s been hidden",
        "softly observing how light spills in, illuminating the surprises within",
        "systematically checking for any obstructions, enhancing the ease of access",
        "carefully adjusting grip, maintaining control as the box opens wider",
        "gradually feeling satisfaction as the lid lifts completely, unveiling treasures",
        "deliberately concluding the opening, embracing the moment of discovery"
    ],
    "move heavy objects": [
        "gradually shifting weight, feeling the strain in muscles as they engage",
        "deliberately positioning feet for stability, preparing for the lift ahead",
        "gently heaving upward, utilizing body mechanics to manage the load",
        "methodically adjusting grip, ensuring a secure hold on the object",
        "tenderly bracing for impact, feeling determination drive each movement",
        "softly coordinating with others, fostering teamwork to navigate obstacles",
        "systematically pacing steps, ensuring balance as the object is moved",
        "carefully strategizing the best route, minimizing effort and strain",
        "gradually feeling fatigue build, focusing on completing the task",
        "deliberately concluding the lift, releasing the weight with relief"
    ],
    "shake fist": [
        "gradually raising the fist, embodying determination as it ascends",
        "deliberately tightening the grip, feeling intensity build in the gesture",
        "gently shaking it back and forth, conveying frustration or emphasis",
        "methodically adding energy to the shake, heightening emotional expression",
        "tenderly reflecting on the sentiment behind the gesture, feeling empowered",
        "softly observing reactions from others, sensing the shared intensity",
        "systematically integrating movement into the body, enhancing expression overall",
        "carefully emphasizing each shake, reinforcing the message intended",
        "gradually feeling adrenaline surge, energizing the motion further",
        "deliberately concluding the gesture, embracing the emotion conveyed"
    ],
    "throw up cap/hat": [
        "gradually lifting the cap, anticipation building as it nears the peak",
        "deliberately positioning it for a toss, feeling the excitement rise",
        "gently releasing it into the air, watching it soar upward",
        "methodically tracking its arc, enjoying the flight as it ascends",
        "tenderly reflecting on the moment, feeling joy in the spontaneity",
        "softly observing others’ reactions, sharing in the light-heartedness",
        "systematically preparing for the catch, anticipating its return",
        "carefully preparing to celebrate the act, feeling camaraderie grow",
        "gradually enjoying the playful atmosphere, feeling liberated and free",
        "deliberately concluding the throw, savoring the moment of fun"
    ],
    "capitulate": [
        "gradually lowering defenses, feeling the weight of resistance ease",
        "deliberately accepting the situation, a sense of relief washing over",
        "gently nodding in acknowledgment, recognizing the futility of further struggle",
        "methodically conceding ground, shifting focus toward resolution",
        "tenderly reflecting on choices made, embracing the need for change",
        "softly acknowledging others' perspectives, feeling unity begin to form",
        "systematically adapting to new realities, fostering an open mindset",
        "carefully weighing options, feeling a calm settle in acceptance",
        "gradually finding peace in surrender, embracing the outcome ahead",
        "deliberately concluding the struggle, feeling the freedom in letting go"
    ],
    "cross arms": [
        "gradually bringing arms across the chest, feeling the stance firm up",
        "deliberately positioning each arm, reinforcing a protective barrier",
        "gently adjusting the grip, enhancing the feeling of security held",
        "methodically shifting weight, grounding the body in the gesture",
        "tenderly reflecting on feelings expressed, embodying confidence and resolve",
        "softly observing surroundings, conveying a sense of control",
        "systematically reinforcing the posture, emphasizing strength through stance",
        "carefully maintaining the crossed position, feeling comfort in the closure",
        "gradually allowing tension to dissipate, embracing the calm felt",
        "deliberately concluding the action, appreciating the moment of poise"
    ],
    "arm circles": [
        "gradually extending arms outward, feeling muscles warm up with each rotation",
        "deliberately increasing the size of circles, enhancing range of motion",
        "gently adjusting pace, ensuring fluidity and grace in the movement",
        "methodically incorporating breath, feeling relaxation build with each cycle",
        "tenderly reflecting on physical sensations, enjoying the stretch felt",
        "softly observing others, sharing energy through synchronized movements",
        "systematically varying direction, engaging different muscle groups effectively",
        "carefully focusing on form, enhancing the quality of the circles drawn",
        "gradually feeling invigorated, embracing the flow of energy generated",
        "deliberately concluding the exercise, appreciating the vitality restored"
    ],
    "arm swings": [
        "gradually lifting arms to the side, feeling freedom in movement unfold",
        "deliberately swinging them forward and back, enhancing circulation steadily",
        "gently incorporating rhythm, enjoying the flow of motion experienced",
        "methodically increasing speed, feeling adrenaline pump with each swing",
        "tenderly reflecting on the release of tension, embracing the lightness felt",
        "softly observing body alignment, ensuring movements remain balanced",
        "systematically integrating full body engagement, maximizing the benefit gained",
        "carefully varying angles, engaging different muscle groups effectively",
        "gradually feeling energized, embracing the dynamic nature of the swings",
        "deliberately concluding the movement, enjoying the sense of liberation"
    ],
    "run on the spot": [
        "gradually lifting knees, feeling energy build with each stride taken",
        "deliberately increasing tempo, heart rate elevating as motion intensifies",
        "gently incorporating arm movement, enhancing the rhythm of running",
        "methodically maintaining posture, ensuring balance while staying in place",
        "tenderly reflecting on endurance, feeling determination drive each step",
        "softly observing surroundings, fostering a sense of focus and purpose",
        "systematically engaging core, enhancing stability throughout the motion",
        "carefully pushing limits, feeling sweat begin to bead with exertion",
        "gradually experiencing a rush of endorphins, embracing the vitality felt",
        "deliberately concluding the run, savoring the invigorating energy released"
    ],
    "butt kicks": [
        "gradually bringing heels up towards the glutes, feeling muscles engage",
        "deliberately increasing speed, heart rate rising with each kick executed",
        "gently alternating legs, maintaining rhythm and balance throughout",
        "methodically incorporating arm swings, enhancing the dynamic nature",
        "tenderly reflecting on the effort, embracing the playful aspect involved",
        "softly observing body alignment, ensuring form remains correct",
        "systematically pushing limits, feeling the burn with each repetition",
        "carefully monitoring breathing, ensuring oxygen flows steadily during activity",
        "gradually experiencing a sense of accomplishment, feeling energized",
        "deliberately concluding the exercise, appreciating the fitness achieved"
    ],
    "cross toe touch": [
        "slowly bending forward, reaching towards toes with focused intent",
        "deliberately crossing one leg over the other, enhancing the stretch",
        "gently lowering torso towards the ground, feeling muscles elongate",
        "methodically aligning hips, ensuring balance while reaching down",
        "tenderly holding the position, savoring the stretch in the hamstrings",
        "softly breathing into the movement, enhancing relaxation and flexibility",
        "systematically alternating sides, creating a rhythm with each touch",
        "carefully engaging core muscles, supporting the body during the reach",
        "gradually increasing depth of stretch, feeling release in tight areas",
        "deliberately concluding the stretch, appreciating the flexibility gained"
    ],
    "side kick": [
        "slowly lifting the leg, ensuring balance while preparing for the kick",
        "deliberately extending the leg sideways, feeling strength in the movement",
        "gently pivoting on the standing foot, enhancing control during execution",
        "methodically aligning the body, emphasizing precision with each kick",
        "tenderly engaging core muscles, supporting stability throughout the action",
        "softly observing the target area, ensuring focus during the kick",
        "systematically varying height and angle, increasing complexity of the movement",
        "carefully resetting stance after each kick, maintaining form and readiness",
        "gradually feeling confidence build, enjoying the fluidity of the motion",
        "deliberately concluding the kicks, relishing the power exhibited"
    ],
    "yawn": [
        "slowly opening the mouth wide, feeling the urge to release tension",
        "deliberately inhaling deeply, savoring the refreshing sensation within",
        "gently stretching the jaw, allowing the face to relax naturally",
        "methodically closing the mouth, feeling the warmth of the breath",
        "tenderly reflecting on the need for rest, embracing the moment",
        "softly noticing the body's response, enjoying the wave of relaxation",
        "systematically allowing the yawn to expand, enhancing its effect",
        "carefully returning to a neutral state, feeling revitalized afterwards",
        "gradually feeling energy shift, appreciating the body's natural rhythms",
        "deliberately concluding the yawn, acknowledging the desire for rejuvenation"
    ],
    "stretch oneself": [
        "slowly raising arms overhead, feeling the spine lengthen with each breath",
        "deliberately leaning to one side, enhancing the stretch along the torso",
        "gently twisting the upper body, releasing tension built up over time",
        "methodically rolling shoulders back, opening up the chest area fully",
        "tenderly focusing on breathing, deepening the relaxation throughout the body",
        "softly adjusting the stance, maximizing the reach in each direction",
        "systematically alternating stretches, promoting overall flexibility and comfort",
        "carefully holding each position longer, savoring the gradual release of tightness",
        "gradually feeling relaxation spread, appreciating the revitalizing sensations",
        "deliberately concluding the stretch, feeling refreshed and invigorated"
    ],
    "blow nose": [
        "slowly bringing a tissue closer, preparing for the release of congestion",
        "deliberately pressing the tissue against the nostrils, ensuring a tight seal",
        "gently exhaling forcefully, feeling relief wash over with each blow",
        "methodically clearing one nostril, enhancing comfort through the process",
        "tenderly reflecting on the necessity, appreciating the clarity regained",
        "softly noticing the change in breathing, feeling the air flow easier",
        "systematically discarding the tissue, embracing the freshness afterwards",
        "carefully wiping excess, ensuring cleanliness and comfort maintained",
        "gradually feeling freedom return, enjoying the relief from blockage",
        "deliberately concluding the action, acknowledging the importance of self-care"
    ],
    "hit with object": [
        "slowly raising the object, preparing for the impactful action ahead",
        "deliberately swinging the item, focusing on the target with intent",
        "gently making contact, feeling the force resonate through the body",
        "methodically following through, ensuring the motion maintains control",
        "tenderly acknowledging the power behind the action, feeling adrenaline rise",
        "softly observing the reaction of the target, gauging effectiveness",
        "systematically adjusting grip, enhancing precision during the strike",
        "carefully resetting stance after impact, ensuring balance is maintained",
        "gradually feeling intensity build, appreciating the strength exhibited",
        "deliberately concluding the hit, reflecting on the action performed"
    ],
    "wield knife": [
        "grasp the knife firmly, preparing for action with a steady grip.",
        "lift the knife confidently, showcasing readiness to perform a task.",
        "hold the knife aloft, signaling intent with a poised hand.",
        "position the knife with precision, eyeing the target carefully.",
        "draw the knife from its sheath, readying for use with purpose.",
        "bring the knife into view, establishing a sense of urgency.",
        "suspend the knife in mid-air, contemplating the next move intently.",
        "align the knife for action, preparing for the imminent cut.",
        "present the knife dramatically, invoking attention with a flourish.",
        "extend the knife outward, signaling readiness to engage."
    ],
    "knock over": [
        "slowly approaching the object, preparing for the deliberate impact",
        "deliberately applying pressure, feeling the force shift the balance",
        "gently watching it topple, enjoying the cascading movement unfold",
        "methodically ensuring the action is controlled, minimizing chaos around",
        "tenderly acknowledging the result, feeling the energy dissipate around",
        "softly observing reactions, appreciating the surprise created by the action",
        "systematically clearing the area, ensuring safety post-impact",
        "carefully resetting the object, restoring order after the knockover",
        "gradually feeling satisfaction in the execution, enjoying the playful nature",
        "deliberately concluding the action, reflecting on the spontaneity of the moment"
    ],
    "grab stuff": [
        "slowly reaching out, fingers extending towards the desired object",
        "deliberately closing the grip, feeling the texture of the item",
        "gently pulling the object closer, ensuring a secure hold",
        "methodically adjusting hand position, enhancing control during the action",
        "tenderly recognizing the importance of the item, feeling connection grow",
        "softly observing surroundings, ensuring focus remains on the task",
        "systematically varying the approach, exploring different ways to grab",
        "carefully resetting stance after grabbing, maintaining balance and readiness",
        "gradually feeling satisfaction in obtaining the item, enjoying the achievement",
        "deliberately concluding the action, appreciating the value of what was grabbed"
    ],
    "shoot with gun": [
        "slowly raising the gun, ensuring proper aim and grip on the handle",
        "deliberately focusing on the target, feeling concentration sharpen",
        "gently squeezing the trigger, feeling the recoil resonate through the body",
        "methodically following through, ensuring precision with each shot fired",
        "tenderly acknowledging the responsibility, feeling the weight of the action",
        "softly observing the impact, gauging the effectiveness of the shot",
        "systematically adjusting stance for stability, enhancing accuracy in aim",
        "carefully resetting after each shot, maintaining composure and readiness",
        "gradually feeling adrenaline surge, enjoying the thrill of the moment",
        "deliberately concluding the action, reflecting on the weight of the responsibility"
    ],
    "step on foot": [
        "gently placing weight down, feeling the pressure increase momentarily",
        "slowly lifting the foot, ensuring a careful recovery from contact",
        "deliberately adjusting stance, observing the reaction of the person",
        "gently shifting weight back, easing any discomfort caused by the step",
        "methodically glancing down, ensuring the foot is free of obstacles",
        "tenderly offering an apology, recognizing the unexpected impact made",
        "softly adjusting position, ensuring clear space to move freely again",
        "systematically checking surroundings, feeling aware of spatial dynamics",
        "carefully moving away, reflecting on the unintentional nature of the act",
        "gradually feeling the tension ease, appreciating the lighthearted moment"
    ],
    "high-five": [
        "slowly bringing hands together, feeling the anticipation build between partners",
        "deliberately raising the hand, ensuring perfect timing for the connection",
        "gently slapping palms, savoring the shared enthusiasm in the gesture",
        "methodically lowering hands post-contact, feeling the camaraderie linger",
        "tenderly exchanging smiles, acknowledging the joy of the moment shared",
        "softly shaking hands afterward, appreciating the friendly interaction",
        "systematically practicing the gesture, enhancing accuracy and rhythm",
        "carefully observing reactions, enjoying the boost of shared energy",
        "gradually transitioning to another interaction, feeling uplifted by the connection",
        "deliberately concluding the moment, reflecting on the fun shared"
    ],
    "cheers and drink": [
        "slowly raising glasses, feeling the excitement in the air build",
        "deliberately clinking glasses together, savoring the sound of celebration",
        "gently sipping the drink afterward, enjoying the taste with friends",
        "methodically expressing well-wishes, feeling the camaraderie strengthen",
        "tenderly sharing laughter, recognizing the bond created through the act",
        "softly leaning back, appreciating the joy of the moment together",
        "systematically raising glasses again, reinforcing the celebratory atmosphere",
        "carefully taking a moment to reflect, enjoying the happiness shared",
        "gradually feeling warmth spread, embracing the joy of connection",
        "deliberately concluding the toast, feeling uplifted by the shared experience"
    ],
    "carry object": [
        "slowly adjusting grip, feeling the weight settle comfortably in hands",
        "deliberately shifting position, ensuring balance is maintained throughout",
        "gently repositioning the object, feeling the strain of the load",
        "methodically checking surroundings, ensuring safe passage while carrying",
        "tenderly recognizing the effort involved, appreciating the object's importance",
        "softly inhaling deeply, maintaining focus as the object is carried",
        "systematically assessing posture, feeling strength in every movement made",
        "carefully moving through space, ensuring obstacles are avoided effectively",
        "gradually feeling fatigue set in, acknowledging the effort put forth",
        "deliberately concluding the task, reflecting on the journey taken"
    ],
    "take a photo": [
        "slowly raising the camera, feeling anticipation for the perfect shot",
        "deliberately adjusting focus, ensuring clarity in the moment captured",
        "gently pressing the shutter, savoring the instant frozen in time",
        "methodically reviewing the photo, appreciating the beauty within the frame",
        "tenderly sharing the moment with others, recognizing the joy of memories",
        "softly stepping back, allowing for a wider perspective in the shot",
        "systematically checking lighting, ensuring the best conditions are met",
        "carefully repositioning for another angle, exploring creativity in photography",
        "gradually feeling satisfaction in the capture, appreciating the experience",
        "deliberately concluding the session, reflecting on the memories made"
    ],
    "follow": [
        "slowly adjusting pace, feeling the connection strengthen with each step",
        "deliberately keeping an eye on the leader, ensuring closeness maintained",
        "gently moving in sync, appreciating the rhythm of shared movement",
        "methodically observing surroundings, feeling aware of the journey taken",
        "tenderly recognizing the trust involved, feeling reassured in the bond",
        "softly shifting focus forward, feeling anticipation for the destination ahead",
        "systematically assessing path, ensuring safety while following closely",
        "carefully matching stride, feeling unity in the act of following",
        "gradually feeling comfort in the routine, enjoying the journey shared",
        "deliberately concluding the action, reflecting on the shared experience"
    ],
    "whisper": [
        "slowly leaning in closer, feeling the intimacy of the shared secret",
        "deliberately softening voice, ensuring words are heard clearly yet discreetly",
        "gently pausing for effect, savoring the moment of connection made",
        "methodically checking surroundings, ensuring privacy is maintained during exchange",
        "tenderly recognizing the trust involved, feeling a bond deepen through sharing",
        "softly observing reactions, appreciating the quiet understanding shared",
        "systematically allowing words to flow, enhancing the intimacy of the moment",
        "carefully choosing words, feeling the weight of what is being conveyed",
        "gradually feeling the urgency fade, savoring the shared confidence expressed",
        "deliberately concluding the whisper, reflecting on the closeness established"
    ],
    "exchange things": [
        "slowly reaching out, feeling the anticipation of the exchange build",
        "deliberately handing over the item, recognizing the trust involved",
        "gently receiving the object, appreciating the connection established",
        "methodically ensuring clarity in the exchange, avoiding any confusion",
        "tenderly acknowledging the importance of the items traded, feeling gratitude",
        "softly observing reactions, enjoying the mutual benefit of the exchange",
        "systematically reinforcing the bond, appreciating the shared experience",
        "carefully adjusting grip, ensuring the objects are handled with care",
        "gradually feeling satisfaction in the transaction, enjoying the collaboration",
        "deliberately concluding the exchange, reflecting on the significance shared"
    ],
    "support somebody": [
        "slowly offering a hand, feeling the strength of connection being built",
        "deliberately adjusting stance, ensuring stability for the person being supported",
        "gently reassuring with words, appreciating the trust placed in you",
        "methodically listening closely, enhancing the bond through understanding",
        "tenderly recognizing their needs, feeling a sense of purpose arise",
        "softly providing encouragement, fostering a positive environment for growth",
        "systematically checking in, ensuring comfort and safety throughout",
        "carefully observing body language, feeling attuned to their emotions",
        "gradually feeling the weight of responsibility, appreciating the bond formed",
        "deliberately concluding the support offered, reflecting on the connection made"
    ],
    "rock-paper-scissors": [
        "slowly revealing choice, feeling the excitement build as results unfold",
        "deliberately observing reactions, appreciating the playful competitiveness present",
        "gently transitioning to the next round, feeling the anticipation heighten",
        "methodically counting down, enhancing the thrill of the game",
        "tenderly acknowledging the fun of the moment, feeling camaraderie grow",
        "softly celebrating victories, enjoying the friendly rivalry shared",
        "systematically refining strategy, enhancing skills with each round played",
        "carefully resetting for the next game, feeling energized by the challenge",
        "gradually feeling joy in the playful nature, embracing the lightheartedness",
        "deliberately concluding the game, reflecting on the enjoyment shared"
    ]
}


