{
    "bow": [
        "The upper body tilts forward at the hips while arms hang loosely by the sides.",
        "The torso bends at the waist, lowering the head while maintaining straight legs.",
        "Shoulders drop gently as the neck flexes, creating a graceful bowing motion.",
        "The entire spine curves forward, with feet firmly planted for stability.",
        "Arms extend downwards naturally as the head tilts slightly to show respect.",
        "The chest moves downward while the knees remain straight, emphasizing the bow.",
        "The hips pivot forward while the upper body inclines towards the ground.",
        "Fingers relax as the body inclines, signaling a respectful gesture to others.",
        "The head drops low, and the back curves, creating a pronounced bow.",
        "Knees stay aligned while the upper body leans forward, maintaining balance."
    ],
    "brushing hair": [
        "One arm lifts the brush while the other remains stable against the hip.",
        "Fingers comb through hair from scalp to tips, gently detangling strands.",
        "The wrist rotates as the brush sweeps through the hair, ensuring smoothness.",
        "The head tilts slightly to one side to access hair more easily.",
        "The elbow bends as the brush moves upward through the hair lengths.",
        "The body leans toward a mirror, enhancing visibility while brushing hair.",
        "Fingers glide through hair while the other hand controls the brush's motion.",
        "The shoulders relax as the hands work through various hair sections.",
        "The arm extends outwards, brushing back loose strands for a polished look.",
        "The body turns slightly, positioning the brush for efficient styling."
    ],
    "brushing teeth": [
        "One arm raises the toothbrush towards the mouth, aiming for precision.",
        "The wrist pivots as the brush makes circular motions on each tooth.",
        "The head tilts slightly forward, ensuring thorough cleaning of the mouth.",
        "Elbows bend while maintaining a firm grip on the toothbrush handle.",
        "The body stands upright, with feet firmly planted during the brushing action.",
        "Fingers hold the brush steady as it glides over the teeth and gums.",
        "The shoulders remain relaxed, allowing focus on oral hygiene tasks.",
        "The mouth opens slightly to provide better access for brushing teeth.",
        "The chin lifts as the toothbrush reaches the upper molars and incisors.",
        "The hips align with shoulders to maintain a balanced brushing posture."
    ],
    "check time (from watch)": [
        "One arm lifts, angling the wrist towards the eyes for a clear view.",
        "The head tilts forward slightly as the eyes focus on the watch face.",
        "Fingers adjust the position of the watch for optimal visibility.",
        "Elbow bends to raise the arm to eye level, ensuring ease of access.",
        "The body turns subtly to align the watch with the line of sight.",
        "Wrist rotates as the watch is tilted for better light reflection.",
        "Shoulders elevate slightly as the arm lifts to check the time.",
        "Hand positions the watch closer to the face for a quick glance.",
        "The torso leans forward slightly to emphasize the action of checking time.",
        "The eyes narrow, concentrating on the watch as time is confirmed."
    ],
    "cheer up": [
        "Arms lift high, creating a wide arc while the body stands confidently.",
        "The head tilts back, displaying a bright smile and open expression.",
        "Shoulders rise as arms extend outward, signaling joy and encouragement.",
        "Hands wave energetically, expressing enthusiasm and positivity in the moment.",
        "The chest expands as the body takes a deep breath of excitement.",
        "The torso sways rhythmically, reflecting the mood of cheerfulness.",
        "Elbows bend slightly as hands come together in a celebratory gesture.",
        "The hips shift from side to side, enhancing the lively atmosphere.",
        "The fingers spread wide as arms rise to emphasize the joyful action.",
        "The body projects an open posture, inviting others to join in the celebration."
    ],
    "clapping": [
        "Both hands come together forcefully, palms meeting at chest height.",
        "The arms lift upward, generating sound with each clap and creating rhythm.",
        "Shoulders engage slightly, raising the arms in a lively clapping motion.",
        "Elbows bend as hands strike together, producing enthusiastic applause.",
        "The body bounces slightly, embodying the energy of celebration and appreciation.",
        "Fingers spread wide while clapping, enhancing the sound and impact.",
        "The head nods in rhythm with the clapping, syncing body and action.",
        "Hips sway gently with each clap, adding a dynamic element to applause.",
        "The torso remains upright while arms repeatedly rise and fall with excitement.",
        "The feet remain grounded as the arms create joyful movement above."
    ],
    "cross hands in front (say stop)": [
        "Arms cross firmly at the wrists, forming a barrier in front of the body.",
        "Elbows bend sharply as hands align horizontally to signal a stop.",
        "Shoulders tense slightly, asserting authority through crossed arms.",
        "Fingers extend wide, palms facing outward, communicating a clear message.",
        "The body leans back slightly, reinforcing the gesture of halting movement.",
        "The head shakes gently while maintaining the crossed-arm position.",
        "Torso remains upright, showcasing confidence in the action of stopping.",
        "Wrists rotate to align palms outward, emphasizing the stop signal.",
        "Hips stabilize while arms create a physical barrier in front.",
        "The chest rises, projecting a strong posture while crossing the arms."
    ],
    "drink water": [
        "One hand lifts a glass smoothly towards the mouth, aiming carefully.",
        "Elbow bends as the glass tilts, directing water into the mouth.",
        "The head tilts back slightly to facilitate a smooth drinking motion.",
        "Fingers grip the glass securely, ensuring a firm hold while drinking.",
        "Shoulders relax while the body leans forward slightly to sip.",
        "The wrist pivots as the glass is tilted towards the lips.",
        "Chin lowers momentarily as water enters the mouth for swallowing.",
        "Hips align with the shoulders to maintain balance while drinking.",
        "Eyes focus on the glass, ensuring precise timing during the sip.",
        "The torso stabilizes as the hand guides the glass towards the face."
    ],
    "drop": [
        "One hand releases an object smoothly, allowing it to fall freely.",
        "Elbow extends as fingers open wide to let go of the item.",
        "Shoulder drops slightly, preparing for the release of the object.",
        "The body leans back slightly in reaction to the sudden drop.",
        "Fingers unclench firmly, ensuring the object descends without obstruction.",
        "The head turns downward to follow the path of the falling object.",
        "The torso remains upright while the hand descends during the drop.",
        "Hips shift slightly, adjusting posture in response to the drop action.",
        "The wrist rotates as the object leaves the grip of the fingers.",
        "The body pauses momentarily, anticipating the impact of the dropped item."
    ],
    "eat meal/snack": [
        "One hand lifts food towards the mouth, focusing on the bite.",
        "The elbow bends as food is brought closer for easier access.",
        "The head tilts forward slightly, preparing to take a hearty bite.",
        "Fingers grip the food securely, ensuring a firm hold during eating.",
        "Shoulders relax as the body enjoys the meal, savoring each moment.",
        "The body leans forward to reach the plate, enhancing engagement.",
        "The mouth opens wide, allowing a generous bite of food.",
        "The torso remains stable while chewing, maintaining an upright posture.",
        "Hips shift slightly for comfortable seating while enjoying the meal.",
        "Eyes focus intently on the food as each bite is taken thoughtfully."
    ],
    "falling": [
        "The body tilts forward with arms flailing while gravity pulls it down, feet trailing behind, creating an uncontrolled descent toward the ground.",
        "Shoulders drop as the torso leans, legs lifted slightly off the ground, emphasizing the moment before the body makes contact with the surface below.",
        "With a sudden loss of balance, the head drops low while the arms extend outward, showcasing the natural response to falling through the air.",
        "The entire body descends rapidly, knees bending slightly as the arms reach for balance, creating an elegant yet chaotic free-fall experience.",
        "As the center of gravity shifts downward, the torso collapses forward while limbs extend in various directions, accentuating the fluidity of the falling motion.",
        "The body tumbles sideways, legs kicking back while arms stretch wide to maintain equilibrium in the face of gravity’s pull.",
        "With a graceful motion, the torso drops, and arms spread wide, signaling surrender to gravity's force in a dramatic fall.",
        "The head turns downwards, eyes fixated on the ground as the body falls, legs trailing behind, creating a dynamic yet vulnerable moment.",
        "As the body loses stability, shoulders roll forward, arms extend outward, emphasizing the elegant yet uncontrolled descent towards the ground.",
        "The torso leans forward sharply, arms wave in a futile attempt to regain balance while the legs kick back during the fall."
    ],
    "giving something to other person": [
        "The arm extends outward, fingers gracefully releasing the item towards the other person, showcasing an intentional act of sharing with a warm smile.",
        "With a gentle motion, the shoulder rolls back as the hand moves forward, creating a seamless transfer of the object between individuals.",
        "The torso leans in slightly, emphasizing the gesture of giving while the fingers delicately hold the item, ensuring a smooth handoff.",
        "A confident motion guides the hand outward, palms up, as the fingers loosen their grip, allowing the object to slide into the other person's grasp.",
        "The body angles slightly, presenting the object with open palms while the other arm stabilizes the transfer, reinforcing the connection between both individuals.",
        "With an enthusiastic gesture, the arm reaches out, fingers extending towards the recipient, enhancing the importance of the shared moment through body language.",
        "The hand moves forward smoothly, palm facing up, while the elbow bends slightly, ensuring the object is passed effectively to the other person.",
        "Shoulders relax as the body shifts weight towards the other person, allowing for a smooth transfer while maintaining eye contact for connection.",
        "The wrist rotates gently as the hand presents the item, fingers gently curling to facilitate a gracious offering to the other individual.",
        "With an open gesture, the arm stretches forward, fingers poised to pass the object, reinforcing the warmth and intention behind the act of giving."
    ],
    "hand waving": [
        "The arm rises high, palm open, while the fingers spread wide, creating an inviting gesture to attract attention and greet someone across the room.",
        "Shoulders engage as the hand moves side to side, emphasizing enthusiasm in the waving motion while the body shifts slightly for better visibility.",
        "With a fluid motion, the wrist rotates as the fingers wave rhythmically, enhancing the friendly nature of the gesture towards onlookers.",
        "The body shifts weight from one foot to another, creating an energetic wave with the hand, capturing the spirit of excitement and friendliness.",
        "The fingers flutter gracefully as the arm moves up and down, reinforcing the joyful expression conveyed through the act of waving.",
        "The head tilts slightly to engage with others as the hand waves, demonstrating warmth and friendliness while the body remains open and inviting.",
        "As the hand rises, fingers splay wide in a cheerful wave, drawing attention and inviting interaction from those nearby.",
        "With a quick flick of the wrist, the hand waves enthusiastically, capturing the attention of others and establishing a friendly connection.",
        "The arm extends outward with a joyful flourish as the hand waves, signaling excitement and openness in communication with others.",
        "The body leans slightly to one side while the hand moves rhythmically, creating a lively wave that engages and connects with the surrounding audience."
    ],
    "handshaking": [
        "Two hands meet firmly, fingers intertwining as the palms press together, reinforcing the bond of greeting and agreement through a strong handshake.",
        "The body leans slightly forward, establishing a connection while the hands clasp tightly, showcasing mutual respect during the handshake.",
        "With an assertive motion, one hand reaches out, initiating a firm grip that conveys confidence and intention in the handshake gesture.",
        "Shoulders relax as the arms extend toward each other, fostering a warm and friendly atmosphere during the handshake while the bodies align closely.",
        "The head nods gently as hands connect, emphasizing the importance of the handshake as a form of communication and relationship-building.",
        "Fingers interlock securely while the elbows bend slightly, creating a dynamic handshake that reinforces camaraderie and partnership between the individuals.",
        "The body maintains a confident posture while the hands shake firmly, establishing a connection that conveys trust and mutual understanding.",
        "With a smooth motion, the palms clasp together, creating a firm handshake that signifies agreement and establishes rapport between the two people.",
        "As hands meet, the torso angles slightly, highlighting the intentionality behind the handshake, while the heads tilt forward in acknowledgment.",
        "The arms extend with purpose, fingers clasping tightly as the handshake solidifies the connection, embodying both professionalism and friendliness in the interaction."
    ],
    "hopping (one foot jumping)": [
        "The body springs upward energetically on one foot, with the opposite knee raised high, arms swinging for balance and momentum.",
        "With an enthusiastic motion, the standing leg propels the body into the air while the arms extend outward to aid in stability.",
        "The torso leans slightly forward, engaging the core as the free leg kicks back during the lively one-foot hop, emphasizing joyful movement.",
        "As the knee lifts sharply, the other leg pushes off the ground, creating a dynamic and playful hopping motion that showcases agility.",
        "The head tilts back slightly while the arms pump rhythmically, enhancing the upward thrust of the body as it hops energetically.",
        "One foot maintains balance on the ground while the other leg tucks in, showcasing the joyful spirit of hopping with each playful leap.",
        "The body aligns vertically as the standing leg springs upward, with arms coordinating for balance, resulting in an elegant yet spirited hop.",
        "With excitement, the leg rises to create momentum as the torso remains stable, embodying the joy of hopping on one foot.",
        "The feet alternate between hopping motions, emphasizing agility and energy while the upper body remains upright for balance during the jump.",
        "The entire body engages in a joyful leap, with the arms flailing slightly as the knee rises, creating a lively and cheerful hopping rhythm."
    ],
    "hugging other person": [
        "Arms encircle another person warmly, drawing them close while the torso leans in, emphasizing affection and comfort during the embrace.",
        "With a gentle motion, the body tilts forward slightly as the arms wrap around the other individual, creating a secure and loving hug.",
        "The head rests comfortably against the shoulder, and fingers interlace gently behind the back, enhancing the emotional connection established through the hug.",
        "As the bodies come together, shoulders relax and arms envelop the other person, conveying warmth and safety in the embrace.",
        "The torso leans in closely while the arms tightly embrace the other individual, solidifying the bond of friendship and support during the hug.",
        "The body inclines slightly, allowing the arms to wrap around the other person, fostering a sense of unity and warmth in the hug.",
        "Fingers gently clasp around the back while the torso presses forward, creating an intimate and comforting embrace shared between two individuals.",
        "The hug tightens as the bodies align closely, showcasing trust and affection while the arms maintain a secure hold around the other person.",
        "With a joyful spirit, the arms extend outward, pulling the other person in for a heartfelt hug, embodying connection and care.",
        "The head tilts slightly as the embrace deepens, emphasizing emotional support while the arms create a protective circle around the other individual."
    ],
    "jump up": [
        "The legs push off the ground powerfully, sending the body upward while arms reach skyward, embodying excitement and energy.",
        "With a quick bend of the knees, the torso straightens as the body soars into the air, arms extending upward for balance.",
        "The head tilts back slightly as both feet leave the ground, capturing the exhilarating moment of jumping high with enthusiasm.",
        "Arms lift gracefully alongside the body as it ascends, emphasizing the joy and freedom experienced during the jump.",
        "With a spirited push from the legs, the body elevates, arms soaring upward to enhance the height and energy of the leap.",
        "The feet leave the ground simultaneously, while the torso aligns vertically, showcasing determination and enthusiasm in the upward motion.",
        "A powerful thrust sends the body upward, with arms extending outward, capturing the thrill of jumping in the air.",
        "As the knees bend deeply, the entire body rises, arms lifting in unison to celebrate the act of jumping high.",
        "The whole body engages in the jump, legs and arms coordinating to create a fluid motion of elevation and joy.",
        "With a playful spirit, the feet spring off the ground, arms reaching high to maximize the upward leap, emphasizing excitement."
    ],
    "kicking other person": [
        "The leg extends forcefully towards the other person, with the knee raised high, emphasizing the dynamic action of the kick.",
        "With a swift motion, the body pivots on one foot while the other leg strikes outward, targeting the individual nearby.",
        "The torso leans forward slightly as the leg thrusts out, showcasing intent in the movement directed at the other person.",
        "Kicking sharply, the knee lifts while the foot extends, illustrating a direct and assertive action toward the other individual.",
        "The body shifts weight as one leg propels forward, demonstrating agility and precision while aiming a kick at the other person.",
        "With a powerful swing of the leg, the foot aims at the other individual, enhancing the energetic nature of the kick.",
        "As the leg lunges forward, the arms stabilize the body, showcasing a focused and intentional kick aimed at the other person.",
        "The head turns towards the target as the body aligns, emphasizing the accuracy and strength behind the kick aimed at the other individual.",
        "The torso rotates slightly, allowing the leg to extend forcefully towards the other person, capturing the dynamic essence of the kick.",
        "The knee lifts quickly, and the foot strikes outwards, engaging the whole body in the action of kicking towards the other individual."
    ],
    "kicking something": [
        "The leg extends outward forcefully, striking the object with precision while the torso stabilizes for balance during the kick.",
        "With a swift motion, the foot makes contact with the object, demonstrating strength and intention in the kicking action.",
        "The knee raises high as the leg swings forward, emphasizing the dynamic energy behind kicking the object ahead.",
        "The body leans slightly forward while the foot drives into the object, showcasing the purpose of the kick aimed at a target.",
        "A powerful motion sends the foot colliding with the object, illustrating the excitement and energy of the kicking action.",
        "The arms stabilize the body as one leg extends outward sharply, making contact with the object in a decisive kick.",
        "As the foot approaches the object, the torso remains balanced, highlighting the dynamic nature of the kick in progress.",
        "The leg thrusts forward, driving the foot into the object with purpose, while the upper body maintains an upright position.",
        "The body leans slightly as the foot connects with the object, emphasizing the action of kicking with intent and focus.",
        "With a confident motion, the foot strikes the object firmly, showcasing the energy and determination of the kicking action."
    ],
    "make a phone call/answer phone": [
        "The hand lifts the phone to the ear, while the body leans in slightly for clearer communication during the call.",
        "With a swift motion, fingers press the dial or answer button, engaging the entire body for effective communication.",
        "The elbow bends slightly as the phone is held against the ear, showcasing a focused interaction while the body remains still.",
        "The head tilts slightly while the phone is raised, with fingers adjusting the call settings, highlighting the multitasking involved in making a call.",
        "With a smooth motion, the phone is positioned to the ear while the body leans forward, enhancing the listening experience during the conversation.",
        "The wrist rotates to adjust the phone’s position while the other hand gestures, embodying the dynamic engagement of making a call.",
        "The fingers dial the number with precision, while the body inclines forward, illustrating the intent and connection during the phone call.",
        "As the phone is held up, the torso aligns toward it, emphasizing focus on the ongoing conversation while the hand scrolls through contacts.",
        "The body engages actively as the phone is raised to the ear, creating an intimate connection with the person on the line.",
        "The hand grips the phone securely, positioning it comfortably near the ear while the body shifts slightly to enhance focus on the conversation."
    ],
    "pat on back of other person": [
        "The open palm lightly taps the back, conveying warmth while fingers slightly spread for a comforting connection.",
        "The hand rests gently on the back, fingers splayed to emphasize encouragement and support.",
        "With a smooth motion, the palm connects softly, providing reassurance as the arm extends.",
        "A friendly gesture occurs as fingers touch the back, offering comfort with a light pat.",
        "The body leans slightly forward, palm landing softly on the back, embodying camaraderie and warmth.",
        "The hand rises and drops lightly on the back, conveying a supportive gesture of connection.",
        "The arm extends outward, gently patting the back, reinforcing friendship with a soft touch.",
        "The fingers glide over the back gently, signifying connection and comfort through a light pat.",
        "A supportive pat is delivered with an open palm, fingers relaxed against the back.",
        "The hand lands lightly on the back, delivering warmth and encouragement through a gentle pat."
    ],
    "pickup": [
        "The body bends at the waist as hands reach down, fingers grasping the object securely for lifting.",
        "With a smooth motion, the arms lower, hands curling around the item to elevate it.",
        "The knees bend slightly while fingers extend downward, emphasizing the lifting motion of the pickup.",
        "The torso leans forward, fingers gripping firmly as the item is raised from the ground.",
        "The arm extends, hand firmly closing around the object, smoothly transitioning into an upward lift.",
        "The body hunches as hands lower, picking up the item while maintaining balance and focus.",
        "With a quick motion, the hands lift the object off the floor, showcasing agility in action.",
        "The body lowers itself, reaching down with both hands to securely grab the object for pickup.",
        "Fingers curl around the object firmly as the body rises back up, emphasizing the lifting motion.",
        "The arm stretches downwards, fingers wrapping around the item for a smooth lifting action."
    ],
    "playing with phone/tablet": [
        "Fingers dance across the screen, tapping and swiping while the device rests comfortably in both hands.",
        "The arm supports the device as fingers glide over the surface, showcasing engagement and interaction.",
        "The head tilts slightly forward, eyes focused on the screen while fingers manipulate the controls.",
        "A relaxed posture forms as the hands navigate the device, fingers exploring various applications effortlessly.",
        "The thumb scrolls quickly while fingers maintain a grip on the device, enhancing active engagement.",
        "With concentration, the body leans in as fingers tap rhythmically, immersing in the device's interface.",
        "The device is held close as fingers swipe and pinch, embodying interaction and enjoyment in play.",
        "The eyes focus on the screen while the fingers explore, creating an engaging experience with the device.",
        "The hands cradle the device securely, fingers gliding smoothly over the screen in a playful manner.",
        "The body shifts slightly as fingers navigate the touchscreen, highlighting the interactive nature of technology."
    ],
    "point finger at the other person": [
        "The arm extends sharply, finger pointing directly at the other person, capturing attention and intent.",
        "With a precise motion, the index finger juts outward, emphasizing focus on the individual present.",
        "The body rotates slightly as the finger stretches forward, directing clear attention toward the other person.",
        "The hand lifts, finger pointing assertively at the other person, showcasing purpose and clarity.",
        "An intentional gesture occurs as the finger targets the individual, highlighting the significance of the action.",
        "The torso aligns toward the other person as the finger extends outward, emphasizing direct engagement.",
        "The arm rises sharply, finger directing focus clearly at the individual, enhancing the interaction.",
        "The finger points with determination, drawing attention to the other person and indicating intention.",
        "With a confident motion, the finger extends toward the individual, emphasizing communication and clarity.",
        "The hand gestures assertively, finger pointing toward the other person to capture their attention."
    ],
    "pointing to something with finger": [
        "The arm extends outward, finger extended toward the object, effectively directing attention with clarity.",
        "With a quick motion, the finger points sharply at the item, emphasizing its importance visually.",
        "The hand lifts, finger guiding focus at the object, enhancing understanding of its location.",
        "An assertive gesture occurs as the finger extends toward the item, capturing attention with precision.",
        "The body aligns with the item as the finger stretches outward, emphasizing relevance and importance.",
        "The hand rises, finger extended toward the object, creating a clear visual cue for others.",
        "With focus, the finger points directly at the item, enhancing communication through clear direction.",
        "The finger extends outward, directing attention to the object, showcasing its significance visually.",
        "A clear motion emerges as the finger targets the object, ensuring everyone notices its relevance.",
        "The finger points with purpose, directing attention to the object and highlighting its importance."
    ],
    "punching/slapping other person": [
        "The arm swings forward sharply, fist clenched tightly, delivering a decisive punch to the target.",
        "A quick motion occurs as the palm strikes outward forcefully, landing a slap on the other person.",
        "The shoulder rotates as the fist flies forward, capturing the intensity behind the punch delivered.",
        "With a sudden flick, the hand moves sharply to strike, emphasizing the action's urgency.",
        "The torso pivots sharply as the arm extends, delivering a precise slap to the other individual.",
        "The body tenses as the fist lunges forward, showcasing the aggressive nature of the punch.",
        "An engaging gesture occurs as the arm raises, striking the other person with a quick slap.",
        "The hand rises quickly, palm open, landing a slap that signifies intent and assertiveness.",
        "With a dynamic motion, the fist connects forcefully, highlighting the energy behind the punch.",
        "The body leans forward as the arm extends, delivering a punch that conveys urgency and intent."
    ],
    "pushing other person": [
        "The hands press firmly against the other person, emphasizing physicality and intent in the push.",
        "With a swift motion, the body leans in as hands connect, propelling the individual back.",
        "The torso shifts weight as both hands thrust outward, showcasing assertiveness and determination in the push.",
        "The arm extends strongly, pushing against the other person to create distance effectively.",
        "An engaging gesture emerges as the body leans forward, hands connecting for a decisive push.",
        "The shoulders square off as the hands move forward, driving into the other person assertively.",
        "The body leans slightly, palms pressed outward to create an impactful push against the individual.",
        "With determination, both hands push firmly against the other person, reinforcing the action’s intensity.",
        "A strong motion occurs as both arms thrust forward, demonstrating power in the push against the individual.",
        "The hand connects assertively with the person, demonstrating intent and strength in the pushing action."
    ],
    "put on a hat/cap": [
        "The hands lift the hat, aligning it carefully above the head for a snug fit.",
        "With a gentle motion, the cap is lowered onto the head, adjusting for comfort and style.",
        "The fingers guide the hat down, ensuring a secure fit atop the head during placement.",
        "The body tilts slightly forward as the hands position the cap firmly in place.",
        "With a smooth motion, the hat is lifted and adjusted on the head for personal flair.",
        "The arm reaches up, placing the hat delicately on the head, highlighting individual style.",
        "As the cap is lowered, fingers adjust the brim, ensuring a perfect fit for comfort.",
        "The head tilts slightly as the hands maneuver the hat onto the head snugly and comfortably.",
        "The hands cradle the cap, placing it gently atop the head for style and protection.",
        "With a quick motion, the hat is positioned securely above the head, emphasizing personal style."
    ],
    "put something inside pocket": [
        "The hand reaches down, fingers curling around the item and sliding it smoothly into the pocket.",
        "With a swift motion, the object is dropped into the pocket, ensuring easy accessibility later.",
        "The body leans slightly, allowing the hand to place the item securely inside the pocket.",
        "The fingers grasp the object firmly before sliding it into the pocket for safekeeping.",
        "With an efficient motion, the hand lifts the item, depositing it securely into the pocket.",
        "The arm bends as the hand navigates toward the pocket, placing the item inside carefully.",
        "An effective gesture occurs as the object is tucked securely into the pocket for convenience.",
        "With purpose, the fingers grasp the item and slide it into the pocket for easy retrieval.",
        "The hand descends swiftly, depositing the object within the pocket, ensuring easy access later.",
        "The torso shifts slightly, allowing the hand to tuck the item securely into the pocket."
    ],
    "reading": [
        "The eyes focus intently on the text, hands holding the book open to enhance understanding.",
        "With a relaxed posture, the body leans forward slightly, fingers tracing lines on the page.",
        "The head tilts downward, eyes scanning the words, conveying deep engagement in reading.",
        "The hands turn pages gently, maintaining flow while the eyes absorb the written content.",
        "The body settles comfortably as fingers guide the text, eyes darting back and forth for clarity.",
        "With concentration, the eyes move across lines, fingers positioned to turn the page easily.",
        "The arms rest comfortably while the book is held close, engaging the mind in reading.",
        "The torso leans in as the eyes track the text, hands supporting the book’s weight.",
        "The head tilts slightly as the reader immerses in the story, fingers lightly turning pages.",
        "The body relaxes while the fingers hold the book steady, eyes engaging with the text."
    ],
    "rub two hands together": [
        "Both palms press against each other, fingers interlocking while moving back and forth to create warmth through friction.",
        "Hands glide smoothly, palms creating friction, generating warmth as fingers twist and press together.",
        "Fingers intertwine as palms rub vigorously, generating heat through rhythmic back-and-forth movements.",
        "The hands are brought together, palms sliding against each other to enhance tactile sensations and warmth.",
        "The palms of both hands rub together vigorously, fingers moving rapidly to create friction and heat.",
        "Hands slide against each other, palms pressing and fingers moving in circular motions to generate warmth.",
        "Fingers interlock while palms move together, creating warmth through a gentle, repetitive rubbing motion.",
        "The hands move in a back-and-forth motion, creating heat through friction to enhance tactile sensations.",
        "Palms rub together quickly, fingers intermingling, generating warmth through a friction-based motion.",
        "Both hands come together, rubbing vigorously to create warmth while generating a soothing tactile experience."
    ],
    "salute": [
        "The right hand raises to the forehead, fingers extended and palm facing inward in a respectful gesture.",
        "With a sharp motion, the hand lifts to the brow, displaying a formal greeting with fingers extended.",
        "The arm extends upward, palm flat, fingers pointing forward to acknowledge someone with a salute.",
        "The fingers touch the forehead briefly while the arm extends outward, signaling respect and acknowledgment.",
        "A swift motion brings the hand to the forehead, fingers aligned and palm inward, representing a salute.",
        "The arm lifts, fingers pointed, palm facing forward, conveying a respectful acknowledgment in a formal gesture.",
        "With a quick movement, the hand touches the brow, extending outward in a traditional salute.",
        "The palm touches the forehead, fingers pointing forward, expressing a formal gesture of respect and greeting.",
        "The arm rises with fingers extended, signaling acknowledgment and respect in a classic salute.",
        "The hand moves to the brow in a swift salute, signifying recognition and respect for another person."
    ],
    "sitting down": [
        "The body lowers gradually, bending at the knees as it settles onto a chair or surface.",
        "The torso descends while knees bend, shifting weight back to find balance on the seated surface.",
        "Hips move backward while bending the knees, allowing the body to settle into a seated position.",
        "The legs bend as the torso lowers, finding comfort on the seat with a gentle motion.",
        "Knees flex, bringing the body downwards as it prepares to rest on a chair or bench.",
        "The torso tilts forward slightly as the knees bend, guiding the body into a seated position.",
        "As knees bend, the body shifts downward, settling comfortably onto the chair or surface below.",
        "The hips shift back as the knees bend, guiding the body into a sitting posture effortlessly.",
        "The body lowers while the knees flex, allowing a smooth transition into a comfortable seated position.",
        "The legs bend and the torso lowers gradually, settling into a seated stance with balance."
    ],
    "standing up": [
        "The body straightens as legs extend, pushing upward into an upright position from sitting or resting.",
        "With a swift motion, the knees extend, raising the body up from a seated or crouched position.",
        "The torso rises while legs straighten, shifting weight upward to transition smoothly into standing.",
        "The hips engage while legs push down, lifting the body into a standing position with stability.",
        "Knees extend fully, elevating the body as it transitions from sitting to a standing posture.",
        "The body rises gradually, legs extending and torso aligning to achieve an upright position smoothly.",
        "As the torso straightens, legs extend powerfully, lifting the body into an upright stance.",
        "The legs straighten while the body pushes upward, transitioning smoothly into a standing position.",
        "With a firm motion, the knees extend, elevating the body from a seated position into standing.",
        "The hips engage while the legs push downward, lifting the body into an upright stance fluidly."
    ],
    "take off a hat/cap": [
        "The hands grasp the brim, lifting the hat upward and away from the head smoothly.",
        "Fingers curl around the cap, gently removing it while the head tilts slightly to assist.",
        "Hands grasp the sides of the hat, elevating it upward while keeping a steady motion.",
        "With a swift motion, the arms pull the hat off the head, revealing the hair beneath.",
        "The fingers grip the cap firmly, pulling it off the head while maintaining balance.",
        "The hands rise above the head, gently removing the hat in a controlled and fluid motion.",
        "As the hands pull the hat upward, the body tilts slightly, ensuring a smooth removal.",
        "The fingers grasp the brim tightly, elevating the hat from the head with precise movement.",
        "With a gentle lift, the hat is removed, fingers guiding it away from the head smoothly.",
        "The cap is pulled upward using both hands, allowing the head to be uncovered effortlessly."
    ],
    "take off glasses": [
        "The fingers grasp the frames, gently sliding the glasses off the face with a careful motion.",
        "With both hands, the frames are pinched, pulling the glasses away from the eyes gracefully.",
        "Hands reach up, fingers curling around the temples to remove the glasses without haste.",
        "The glasses are lifted from the face as fingers slide along the arms to reveal clear vision.",
        "As fingers grip the frames, the glasses are pulled away from the eyes with precision.",
        "The hands move to the sides, lifting the glasses off the face with a fluid motion.",
        "With a swift motion, the hands remove the glasses, fingers gripping the arms with care.",
        "Fingers navigate to the frames, gently pulling the glasses away from the face effortlessly.",
        "The hands grasp the glasses securely, lifting them from the face to reveal unobstructed sight.",
        "The fingers curl around the frames, sliding the glasses off the face smoothly and efficiently."
    ],
    "take off jacket": [
        "Hands grasp the jacket sleeves, pulling them downward while the torso leans back slightly for balance.",
        "With a swift motion, the arms pull the jacket off the shoulders, revealing the clothing beneath.",
        "The body leans slightly forward as hands remove the jacket, sliding it off each arm carefully.",
        "Fingers grasp the collar, pulling the jacket down while the body shifts to assist the motion.",
        "As the arms move backward, the jacket is pulled off, freeing the upper body comfortably.",
        "The torso leans back while hands grip the jacket, sliding it off the shoulders fluidly.",
        "With a deliberate gesture, the hands pull the sleeves off, lowering the jacket to the waist.",
        "Arms extend outward, gently removing the jacket from the shoulders while showcasing ease of movement.",
        "The hands grip the sleeves firmly, sliding the jacket off smoothly to reveal the outfit underneath.",
        "With fluidity, the arms pull the jacket off, allowing the body to breathe freely afterward."
    ],
    "take out something from pocket": [
        "Fingers dip into the pocket, retrieving the item while the body stands upright and steady.",
        "With a swift motion, the hand plunges into the pocket, grasping the object firmly and swiftly.",
        "The hand reaches into the pocket, fingers curling around the item, lifting it out carefully.",
        "The body shifts slightly as the hand reaches down, retrieving the object from the pocket smoothly.",
        "Fingers navigate inside the pocket, grasping the item firmly before withdrawing it with precision.",
        "With accuracy, the hand retrieves the object from the pocket, showcasing fluidity in the motion.",
        "The arm bends slightly as fingers curl around the item, pulling it out from the pocket smoothly.",
        "The hand delves into the pocket, fingers wrapping around the item before pulling it out gently.",
        "As fingers locate the object, the hand lifts it from the pocket effortlessly and confidently.",
        "The body leans slightly as the hand reaches deep into the pocket, retrieving the item quickly."
    ],
    "taking a selfie": [
        "The arm extends outward, holding the phone up while fingers adjust the angle for a perfect photo.",
        "With a quick motion, the body shifts slightly to frame the shot as the arm lifts.",
        "The phone is held at arm's length, fingers tapping the screen to capture the moment nicely.",
        "The body angles slightly as the arm extends, capturing a candid moment with a smile.",
        "With a confident pose, the hand holds the phone up, capturing the scene in front effortlessly.",
        "The fingers press the button while the other hand strikes a pose for the selfie with excitement.",
        "The body tilts slightly as the arm extends, framing the face perfectly for the selfie shot.",
        "With both hands, the phone is positioned to ensure a flattering angle for the selfie.",
        "The arm lifts the phone high while the body angles slightly to capture the best view possible.",
        "The fingers press the shutter button as the arm extends, ensuring the perfect selfie moment captured."
    ],
    "tear up paper": [
        "Fingers grip the paper firmly, ripping it apart with controlled force as the body leans forward.",
        "With a swift motion, hands pull the paper apart, showcasing a clear tear through the material.",
        "The hands grasp the edges of the paper, pulling apart to create uneven pieces effortlessly.",
        "As the fingers grip the paper's edge, a tearing motion unfolds, creating multiple fragments quickly.",
        "The body leans slightly forward while the hands grip the paper, tearing it into smaller pieces.",
        "The fingers pinch the paper tightly before ripping it apart, allowing the body to emphasize the motion.",
        "With determination, the hands pull the paper apart, demonstrating force as it tears easily.",
        "Fingers curl around the paper, creating tension before a swift motion rips it into fragments.",
        "The body shifts slightly as hands grasp and tear the paper apart, generating multiple uneven pieces.",
        "The fingers grip firmly, pulling the paper apart with force, resulting in an audible tearing sound."
    ],
    "throw": [
        "The arm swings back powerfully, fingers gripping tightly, body shifting weight forward for momentum.",
        "With a swift motion, the hand releases the object, body rotating slightly for added force.",
        "Fingers extend as the ball is flung, arm moving in a full arc, body leaning forward.",
        "The shoulder rotates as the arm launches the item, fingers flicking to enhance the throw.",
        "Body leans into the throw, arm extended forward, fingers releasing the object with precision.",
        "With a strong push, the arm propels the object forward, the body follows the motion.",
        "Hand flicks outward, fingers releasing the item, while the body shifts weight for balance.",
        "The wrist snaps as the arm throws the object, body leaning slightly to maintain stability.",
        "Fingers grip firmly, arm moves swiftly, releasing the object high, body poised for follow-through.",
        "The shoulder drives the arm forward, fingers unclenching as the object sails through the air."
    ],
    "touch back (backache)": [
        "Fingers apply gentle pressure to the lower back, body leaning slightly for added relief.",
        "Palm rests against the back, fingers digging in, while the body stabilizes to ease discomfort.",
        "With a light touch, hands rub the back area, body tilting for greater comfort and relaxation.",
        "Fingers explore the muscles of the lower back, body bending slightly forward to alleviate pain.",
        "The palm presses firmly into the back, fingers spreading to soothe while the body remains upright.",
        "Hands clasp the lower back, providing pressure as the body leans forward for relief.",
        "Fingers massage the back muscles, body swaying slightly as tension is released from the area.",
        "With a firm grip, hands touch the back, body shifting to find the best angle for comfort.",
        "Fingers trace along the spine, applying gentle pressure while the body remains in a relaxed position.",
        "The hands wrap around the waist, fingers pushing gently to relieve backache while standing upright."
    ],
    "touch chest (stomachache/heart pain)": [
        "The palm rests against the chest, fingers spreading wide as the body leans slightly for relief.",
        "Fingers apply gentle pressure to the chest, body tilting back for comfort during discomfort.",
        "With a soothing touch, the hand covers the chest, body relaxed to ease any pain.",
        "Fingers press firmly into the chest area, body remaining steady while seeking comfort from pain.",
        "The hand glides over the chest, fingers exploring the area as the body relaxes slightly.",
        "With gentle motions, fingers touch the chest, body adjusting to provide comfort during discomfort.",
        "Fingers spread across the chest, providing a light touch while the body stabilizes for ease.",
        "The palm presses against the chest area, fingers curling gently while the body remains upright.",
        "With careful movements, fingers massage the chest, body tilting to release tension in the area.",
        "Fingers touch the chest softly, while the body shifts slightly to find relief from pain."
    ],
    "touch head (headache)": [
        "Fingers press against the temples, body leaning forward slightly to ease the throbbing sensation.",
        "The palm cradles the head gently, fingers smoothing over the forehead as the body relaxes.",
        "With a light touch, fingers explore the scalp, body tilting back to alleviate pressure.",
        "Fingers massage the base of the skull, body tilting slightly for relief from the headache.",
        "The hand rests on the forehead, fingers gliding softly as the body maintains a stable posture.",
        "Fingers grip the sides of the head, applying gentle pressure while the body remains relaxed.",
        "The palm presses gently on the forehead, fingers splaying out as the body finds comfort.",
        "With deliberate motions, fingers touch the temples, body adjusting slightly to relieve tension.",
        "Fingers move along the hairline, offering soothing pressure as the body stays still and relaxed.",
        "The hand covers the forehead, fingers applying gentle pressure while the body sinks into relaxation."
    ],
    "touch neck (neckache)": [
        "Fingers press gently against the neck, body tilting slightly to relieve tension in muscles.",
        "The palm rests on the side of the neck, fingers curling to massage the area gently.",
        "Hands explore the neck, applying pressure as the body leans forward slightly for comfort.",
        "With fingers gliding along the neck, the body stabilizes while providing a soothing touch.",
        "The hand grips the back of the neck, fingers pressing to alleviate strain while standing.",
        "Fingers trace the contours of the neck, applying gentle pressure while the body remains upright.",
        "With a gentle touch, fingers explore the neck area, promoting relaxation in surrounding muscles.",
        "Hands massage the sides of the neck, providing relief as the body shifts slightly for ease.",
        "The palm presses into the neck, fingers digging in lightly as the body leans back.",
        "Fingers rub the back of the neck, easing tension while the body tilts slightly for comfort."
    ],
    "typing on a keyboard": [
        "Fingers move swiftly across the keyboard, palms resting lightly on the desk, body upright.",
        "Hands hover above the keys, fingers dancing swiftly while the body leans slightly forward.",
        "The fingers tap rhythmically on the keyboard, wrists straight as the body stays relaxed.",
        "With deliberate motions, fingers glide over the keys, the body maintaining a steady posture.",
        "The palms rest on the keyboard while fingers type quickly, body leaning slightly for comfort.",
        "Fingers strike the keys rapidly, palms hovering lightly above as the body remains centered.",
        "With quick movements, the hand fans air towards the face, body leaning in for a breeze.",
        "Hands float above the keyboard, fingers flying as the body shifts slightly for comfort.",
        "Fingers press down on the keys, palms steady, while the body remains relaxed and upright.",
        "Hands glide over the keyboard smoothly, fingers tapping rhythmically as the body stays engaged."
    ],
    "use a fan (with hand or paper)/feeling warm": [
        "The hand waves back and forth, fanning the air, body leaning slightly to catch a breeze.",
        "Fingers flutter a paper fan, the body tilting to enjoy the cool air it creates.",
        "With a swift motion, the hand moves the fan, body swaying gently to catch the airflow.",
        "The paper flutters in the air as fingers fan vigorously, body relaxed and enjoying the coolness.",
        "A hand moves swiftly to create a breeze, while the body tilts slightly for comfort.",
        "Fingers grip the fan tightly, waving it rapidly as the body seeks relief from heat.",
        "With quick movements, the hand fans air towards the face, body leaning in for a breeze.",
        "The hand moves a paper fan swiftly, body tilting slightly to embrace the cool air.",
        "Fingers flutter the fan, the body shifts back slightly to enjoy the refreshing sensation.",
        "The hand waves rapidly, creating a breeze as the body adjusts to the warm environment."
    ],
    "wear jacket": [
        "Hands slide into the sleeves, pulling the jacket over shoulders while the body straightens.",
        "Arms extend, slipping into the jacket, body shifting slightly to adjust for a comfortable fit.",
        "The body lifts the jacket overhead, arms threading through sleeves, settling onto the shoulders.",
        "Fingers grasp the collar, pulling the jacket onto the body as it settles comfortably.",
        "With both hands, the jacket is pulled on, the body tilting slightly for ease.",
        "The torso rotates while the arms slide into the sleeves, securing the jacket in place.",
        "Hands adjust the collar as the body straightens, ensuring the jacket fits snugly.",
        "The body leans slightly as the jacket is pulled over the shoulders, settling in place.",
        "Fingers smooth the fabric of the jacket, body upright as it is worn comfortably.",
        "The arms move gracefully into the sleeves, the body adjusting for a relaxed fit."
    ],
    "wear on glasses": [
        "Fingers grasp the frames, positioning the glasses carefully on the face while the body remains still.",
        "Hands lift the glasses toward the face, adjusting them gently as the body stays relaxed.",
        "With a firm grip, the frames are positioned on the nose, body poised for clarity.",
        "The glasses slide onto the face, fingers adjusting them while the body maintains an upright posture.",
        "The hands position the glasses carefully, fingers curling around the frames, body remaining steady.",
        "Fingers place the glasses on the bridge of the nose, body adjusting for a comfortable fit.",
        "The hand lifts the glasses, positioning them over the eyes while the body stands relaxed.",
        "With delicate movements, the glasses are placed on the face, fingers adjusting for comfort.",
        "Hands carefully position the frames on the face, body upright as the lenses settle in place.",
        "The glasses are positioned delicately on the face, fingers ensuring a snug fit while standing."
    ],
    "wipe face": [
        "Fingers glide across the face, gently wiping away sweat while the body remains upright.",
        "The palm presses lightly against the face, fingers smoothing over skin as the body leans forward.",
        "With a gentle motion, the hand wipes across the cheeks, body steady and relaxed.",
        "The fingers brush across the forehead, removing moisture as the body tilts slightly.",
        "Hands move gracefully to wipe the face, body remaining upright and poised throughout the motion.",
        "Fingers gently wipe sweat from the face, body tilting back slightly for comfort.",
        "With deliberate strokes, fingers clean the face, body stable while moisture is removed.",
        "The hand sweeps across the forehead, fingers splaying out while the body remains steady.",
        "Fingers touch the face gently, wiping away droplets while the body shifts slightly for ease.",
        "The hand glides over the cheeks, wiping away perspiration as the body maintains balance."
    ],
    "writing": [
        "Fingers dance across the paper, gripping the pen tightly while the body leans slightly forward.",
        "The pen glides smoothly as fingers move swiftly, the body focused and slightly bent.",
        "With steady motions, fingers write letters, the body upright as thoughts flow onto the page.",
        "The hand moves fluidly, fingers tracing words while the body stays engaged and upright.",
        "Fingers clutch the pen, writing quickly as the body shifts slightly to find comfort.",
        "The wrist pivots gracefully while fingers shape letters, body steady and relaxed during writing.",
        "With careful strokes, fingers glide over the page, the body upright as words are formed.",
        "Fingers tap rhythmically on the paper, the body remaining stable while writing progresses.",
        "The pen moves effortlessly, fingers engaged, while the body maintains a focused posture.",
        "Hands steady the notebook, fingers writing diligently as the body leans in for clarity."
    ]
}





