{
    "bow": [
        "upper body leans forward while arms hang at sides",
        "torso bends forward with head lowered",
        "waist flexes forward with feet stable",
        "shoulders drop while arms extend downward",
        "knees remain straight as torso inclines forward",
        "head tilts down with a gentle bow of the neck",
        "spine curves as body shifts forward",
        "hips pivot forward while feet remain planted",
        "arms relax downwards as the head bows",
        "upper body inclines as knees remain aligned"
    ],
    "brushing hair": [
        "one arm lifts to bring a brush to hair",
        "hand moves through hair from roots to tips",
        "wrist rotates as brush sweeps across scalp",
        "shoulder raises while the other arm remains stable",
        "fingers glide through hair, untangling knots",
        "head tilts slightly as hair is brushed",
        "elbow bends as brush moves across the head",
        "arm extends outward while brushing hair back",
        "body turns slightly to face a mirror",
        "fingers grasp hair while brushing downwards"
    ],
    "brushing teeth": [
        "one hand raises a toothbrush towards the mouth",
        "elbow bends as the toothbrush moves in circular motions",
        "wrist pivots while scrubbing teeth with gentle strokes",
        "head tilts forward to better reach teeth",
        "body shifts slightly to access different tooth areas",
        "fingers grip the toothbrush firmly while brushing",
        "shoulders relax while focusing on oral hygiene",
        "mouth opens slightly for better access while brushing",
        "chin lifts as toothbrush moves across upper teeth",
        "hips align with shoulders for balanced posture"
    ],
    "check time (from watch)": [
        "one arm raises with the wrist tilted towards the face",
        "head tilts slightly to view the watch",
        "fingers adjust the watch for a better look",
        "elbow bends while lifting the arm to eye level",
        "body turns slightly to align watch with vision",
        "wrist rotates as the watch face is examined",
        "shoulder moves upward slightly while arm lifts",
        "hand positions the watch closer to the face",
        "torso leans forward to bring watch into focus",
        "fingers tap the watch for digital display"
    ],
    "cheer up": [
        "arms extend upward while body stands tall",
        "head tilts back slightly with a smile",
        "shoulders rise as body opens wide",
        "hands wave above head in a joyful motion",
        "fingers spread wide as arms lift",
        "chest expands while taking a deep breath",
        "body sways side to side in happiness",
        "elbows bend as hands move to heart",
        "torso twists slightly with excitement",
        "hips shift rhythmically to express joy"
    ],
    "clapping": [
        "both hands come together with palms aligned",
        "arms lift slightly as hands meet in the air",
        "shoulders elevate as the body engages in applause",
        "fingers extend wide while striking hands together",
        "body bounces slightly with each clap",
        "elbows bend while hands connect forcefully",
        "chest expands with each round of applause",
        "head nods in rhythm with clapping hands",
        "hips sway gently as applause continues",
        "arms move upward and downward in a joyful manner"
    ],
    "cross hands in front (say stop)": [
        "arms cross at the wrists in front of the body",
        "elbows bend sharply while hands align horizontally",
        "shoulders tense as body assumes a halt position",
        "fingers extend wide while palms face outward",
        "body leans slightly back while arms cross",
        "head shakes gently as a signal to stop",
        "torso remains upright while arms assertively cross",
        "wrist rotates to position palms outward",
        "hips stabilize as arms create a barrier",
        "chest rises with a confident posture"
    ],
    "drink water": [
        "one hand lifts a glass towards the mouth",
        "elbow bends as glass approaches lips",
        "head tilts back slightly for a better angle",
        "fingers grasp the glass firmly while tilting",
        "shoulders relax while taking a sip",
        "body leans slightly forward to drink",
        "wrist pivots as the glass is tipped",
        "chin lowers slightly as water enters mouth",
        "hips align with shoulders for stable posture",
        "eyes focus on the glass while drinking"
    ],
    "drop": [
        "one hand releases an object downward",
        "elbow extends as fingers open wide",
        "shoulder drops slightly as the item falls",
        "body leans back slightly in surprise",
        "fingers unclench while letting go of the object",
        "head turns downward to follow the drop",
        "torso remains upright while hand descends",
        "hips shift slightly with the act of dropping",
        "wrist rotates as object leaves hand",
        "body momentarily pauses in anticipation"
    ],
    "eat meal/snack": [
        "one hand raises food towards the mouth",
        "elbow bends while bringing food closer",
        "head tilts forward slightly to take a bite",
        "fingers grip food firmly while eating",
        "shoulders relax as the body enjoys the meal",
        "body leans forward to access the plate",
        "mouth opens wide for a hearty bite",
        "torso remains stable while chewing",
        "hips shift slightly for comfortable seating",
        "eyes focus on food while taking a bite"
    ],
    "falling": [
        "The body tilts forward, arms spread out, and legs dangle downward as gravity pulls.",
        "Shoulders drop as the torso leans forward, while the feet lose contact with the ground.",
        "The head drops low, with arms flailing and legs lifting slightly, surrendering to gravity.",
        "The center of gravity shifts downward, causing the body to descend rapidly and uncontrolled.",
        "Arms extend outward while the torso collapses, with legs trailing behind as the body falls.",
        "The body tumbles headfirst, with legs kicking back and arms reaching out for balance.",
        "The entire body drops, with the head tucked in and limbs extending in a free fall.",
        "As the balance is lost, shoulders roll forward, and the body descends toward the ground.",
        "The torso leans forward sharply, arms wave, and feet lift, leading to a downward motion.",
        "With a sudden shift, the body spirals downward, limbs extended as it succumbs to gravity."
    ],
    "giving something to other person": [
        "The arm extends outward, holding the item while fingers open gently towards the receiver.",
        "Shoulders roll back as the hand moves forward, presenting the object to another person.",
        "The torso leans slightly forward, with the hand reaching out to pass the item smoothly.",
        "Fingers release their grip as the arm stretches toward the other person, offering the object.",
        "The body turns sideways, positioning the hand towards another person for a smooth handoff.",
        "The head nods gently while the arm extends, signaling the act of giving an item.",
        "With a deliberate motion, the wrist rotates to present the object toward the recipient.",
        "The elbow bends as the hand moves forward, delivering the item with a friendly gesture.",
        "Fingers curl gently around the object while the arm extends, ensuring a secure transfer.",
        "The body inclines slightly, arms outstretched, conveying an intention to share the item."
    ],
    "hand waving": [
        "The arm lifts high, fingers spread wide, creating a sweeping motion through the air.",
        "Shoulders rise as the hand moves side to side, emphasizing the greeting or farewell gesture.",
        "With a gentle flick, the wrist rotates, causing the fingers to wave rhythmically back and forth.",
        "The body shifts weight from one foot to another while the arm waves energetically.",
        "The fingers sway gracefully as the elbow bends, creating a fluid motion that captures attention.",
        "The head tilts slightly while the arm extends outward, making a friendly waving motion.",
        "The palm faces outward, creating an open gesture as the hand waves up and down.",
        "Arms move fluidly in a circular pattern, enhancing the visibility of the wave to onlookers.",
        "The entire upper body engages as the hand lifts and waves, inviting interaction from others.",
        "With enthusiasm, fingers dance in the air, signaling excitement while the arm waves freely."
    ],
    "handshaking": [
        "Two hands meet firmly, palms pressed together, with fingers interlocking in a strong grip.",
        "The body leans forward slightly, conveying respect while the hands connect in a handshake.",
        "Shoulders relax as the hands move toward each other, establishing a friendly connection through touch.",
        "The elbow bends while the hand approaches, creating an engaging moment of greeting and agreement.",
        "With a confident motion, one hand reaches out, palm open, initiating a handshake with intent.",
        "The body positions itself toward the other person, showcasing openness as hands come together.",
        "Fingers wrap around the opposing hand, establishing a firm yet respectful grip during the handshake.",
        "The head nods affirmatively as the hands shake, reinforcing mutual respect in the greeting.",
        "The arm extends outward, leading to a swift clasp of hands, symbolizing partnership and unity.",
        "As hands connect, the body remains steady, highlighting the importance of the handshake in communication."
    ],
    "hopping (one foot jumping)": [
        "The body lifts off the ground, balancing on one foot, with the other leg tucked inward.",
        "With a swift motion, the knee rises, propelling the body upward while the arms swing.",
        "One leg kicks up while the body bounces lightly, using arms for balance and momentum.",
        "The torso leans forward slightly as the free leg swings, creating a playful hopping motion.",
        "The body shifts weight to the standing foot, lifting the other leg high with energy.",
        "With excitement, the arms lift and the body springs upward, focusing on the grounded foot.",
        "The foot pushes off the ground, sending the body into the air as the arms extend.",
        "As the leg tucks in, the body hops energetically, emphasizing balance and playful movement.",
        "The knee bends sharply, elevating the body as the opposite foot maintains contact with the ground.",
        "With a cheerful spirit, the body hops on one foot, creating a dynamic and lively rhythm."
    ],
    "hugging other person": [
        "Arms wrap around another person, pulling them close while the torso leans in warmly.",
        "The body leans forward, creating a gentle embrace as fingers intertwine around the back.",
        "Shoulders relax as both bodies come together, conveying warmth through a heartfelt hug.",
        "The head tilts slightly, resting against the other person's shoulder while arms encircle gently.",
        "With a joyful motion, arms extend outward, wrapping securely around the other person in comfort.",
        "The body inclines toward the other person, arms enveloping them in a protective and loving embrace.",
        "As the hug tightens, the torso presses close, creating a secure bond through physical touch.",
        "The hands clasp tightly behind the back, emphasizing the connection established through the hug.",
        "Fingers dig gently into the fabric of clothing as bodies align in a comforting embrace.",
        "The head rests comfortably on the shoulder, signifying trust and affection within the hug."
    ],
    "jump up": [
        "The legs spring upward powerfully, lifting the body off the ground while arms reach high.",
        "With a swift motion, the feet push off the floor, propelling the body into the air.",
        "The torso straightens as the knees bend deeply, creating momentum for a vertical leap.",
        "Both feet leave the ground, and arms extend upward, enhancing the jump's height and energy.",
        "The entire body elevates, arms outstretched, capturing a sense of freedom during the jump.",
        "With excitement, the legs thrust upwards, emphasizing the upward motion as the body soars.",
        "The head tilts back slightly, eyes focused on the height achieved during the jump.",
        "As the feet lift off, the arms swing upward, providing balance and enhancing the leap.",
        "The body aligns straight as it ascends, with a powerful push coming from the legs.",
        "With joyful energy, the legs and arms coordinate, creating a fluid upward motion in the jump."
    ],
    "kicking other person": [
        "The leg extends forcefully, targeting the other person with the foot while the body stabilizes.",
        "A swift motion brings the knee up, with the foot aimed at making contact quickly.",
        "Shoulders square off as the leg propels forward, emphasizing power in the kicking action.",
        "The torso rotates slightly, positioning the body for a strong kick aimed at the opponent.",
        "With a decisive motion, the foot strikes outward, connecting forcefully while the body holds steady.",
        "The knee rises sharply before extending outward, directing the kick with precision and intent.",
        "Arms balance the body as the leg thrusts forward, aiming accurately at the target with power.",
        "The body pivots to align the kick, ensuring focus and strength are channeled through the leg.",
        "Foot meets target firmly, showcasing control and determination as the body stabilizes during the kick.",
        "As the leg extends, the upper body leans back slightly to maintain balance throughout the motion."
    ],
    "kicking something": [
        "The foot strikes the object firmly, propelling it forward as the body stabilizes for balance.",
        "A swift motion brings the leg up, aiming the foot precisely at the target object.",
        "The torso leans slightly forward as the foot extends outward, ensuring a powerful kick.",
        "With determination, the leg thrusts forward, targeting the object with precision and control.",
        "The knee bends before extending sharply, generating force as the foot connects with the object.",
        "Arms remain steady to provide balance while the foot meets the object with strength.",
        "The body positions itself strategically, allowing for a strong and accurate kick directed at the object.",
        "As the foot makes contact, the body aligns perfectly to enhance the power of the kick.",
        "The head focuses on the object, ensuring that the foot strikes with intention and accuracy.",
        "With a determined push, the leg extends, delivering a decisive kick that sends the object flying."
    ],
    "make a phone call/answer phone": [
        "One hand lifts the phone towards the ear, stabilizing with the other hand for support.",
        "The body turns slightly, angling towards the phone as fingers tap the screen to initiate.",
        "The wrist bends as the phone approaches, ensuring a comfortable angle for listening and speaking.",
        "Shoulders relax while the arm reaches out, bringing the phone closer for a clear connection.",
        "The head tilts towards the phone, enhancing sound clarity while the fingers navigate the keypad.",
        "As the call connects, the body remains still, focusing on the conversation with attentive posture.",
        "The finger presses down on the call button, prompting the phone to activate for communication.",
        "The body leans forward slightly, engaging with the call as the other hand holds the phone.",
        "With a quick motion, the phone is raised to the ear, creating an intimate listening experience.",
        "The torso aligns toward the phone while the fingers scroll, preparing to answer or dial the number."
    ],
    "pat on back of other person": [
        "The hand gently connects to the other person's back, signaling comfort and support.",
        "A light tap occurs as the palm lands softly on the back, fostering encouragement.",
        "The arm extends outward, delivering a friendly pat on the back, showcasing camaraderie.",
        "The hand raises and drops lightly onto the back, embodying reassurance and warmth.",
        "A supportive gesture emerges as fingers press gently against the other person’s back.",
        "The palm glides over the back, providing a gentle pat that signifies encouragement.",
        "With an open hand, a soft touch lands on the back, enhancing connection.",
        "The arm swings forward, delivering a light pat to the back, enhancing friendship.",
        "The hand reaches out, softly touching the back to convey support and friendliness.",
        "A comforting pat is given as fingers rest momentarily on the other person’s back."
    ],
    "pickup": [
        "The body bends forward as hands reach down to grasp the object off the ground.",
        "With a swift motion, the arm extends, fingers closing around the item for pickup.",
        "The knees bend while hands extend downward, emphasizing the action of lifting an object.",
        "The torso leans forward, fingers gripping the item firmly from the floor during pickup.",
        "With an agile motion, the hands rise, lifting the object off the ground seamlessly.",
        "A smooth transition occurs as the hands pull the item up from the surface.",
        "The body hunches slightly, hands reaching toward the object to elevate it from below.",
        "The leg positions for balance while the arm stretches to pick up the item.",
        "The fingers curl around the object, pulling it up with a quick, fluid motion.",
        "The body lowers itself, allowing hands to grasp the item securely for lifting."
    ],
    "playing with phone/tablet": [
        "The fingers glide over the screen, tapping and swiping with a focused expression.",
        "The hand holds the device firmly while the thumb navigates across the screen smoothly.",
        "The body reclines slightly as fingers manipulate the screen, showcasing engagement with the device.",
        "Eyes focus intently as hands maneuver around the device, demonstrating interaction and enjoyment.",
        "The thumb scrolls rapidly while fingers support the device, emphasizing active engagement with technology.",
        "The arm extends forward, device held at eye level, fingers dancing over the touchscreen.",
        "A relaxed posture emerges while fingers swipe, creating an interactive moment with the device.",
        "The body leans back, fingers tapping rhythmically on the screen, showcasing leisure and enjoyment.",
        "Hands cradle the device closely, fingers gliding effortlessly across the screen in play.",
        "With a light grip, fingers explore various apps, engaging fully with the mobile device."
    ],
    "point finger at the other person": [
        "The arm extends outward, finger pointing sharply towards the other person, capturing attention.",
        "A decisive gesture occurs as the index finger rises, directing focus to the individual.",
        "With a pointed arm, the finger extends toward the person, emphasizing the message.",
        "The body aligns toward the other person as the finger juts forward in emphasis.",
        "A clear motion emerges as the finger extends, targeting the individual directly for emphasis.",
        "The hand rises, finger outstretched, signaling the other person with intention and clarity.",
        "The torso pivots slightly as the finger points assertively at the other individual.",
        "The arm lifts high, finger directing attention, highlighting the importance of the gesture.",
        "The finger points with precision at the person, drawing attention and engaging interaction.",
        "With an outstretched arm, the finger focuses sharply on the other person for clarity."
    ],
    "pointing to something with finger": [
        "The arm stretches outward, finger extended toward the object, directing attention effectively.",
        "With a swift motion, the finger points directly at the item, highlighting its significance.",
        "The hand lifts, finger directing focus at the object, emphasizing its presence and importance.",
        "An intentional gesture emerges as the finger extends toward the item, capturing attention.",
        "The arm stretches, finger indicating the object clearly, fostering understanding of its location.",
        "The body aligns toward the item as the finger juts forward, highlighting its relevance.",
        "With precision, the finger points out the object, enhancing communication through clear direction.",
        "The hand rises, finger extended toward the item, creating a visual cue for others.",
        "A clear motion arises as the finger targets the object, ensuring everyone notices.",
        "The finger extends outward, pointing purposefully at the object, showcasing its importance visually."
    ],
    "punching/slapping other person": [
        "The arm swings forward sharply, fist clenched tightly, delivering a powerful punch to the target.",
        "A sudden movement occurs as the hand strikes outward forcefully, landing a slap on the other person.",
        "The shoulder rotates while the fist flies forward, emphasizing the intent behind the punch.",
        "With a quick flick, the hand moves sharply to strike, capturing the action's intensity.",
        "The torso pivots sharply as the arm extends, delivering a precise slap to the target.",
        "The body tenses as the fist lunges forward, embodying the aggressive nature of the punch.",
        "An assertive motion occurs as the arm raises, striking the other person with a swift slap.",
        "The hand rises quickly, palm open, landing a slap that resonates with intention.",
        "With a dynamic motion, the fist connects forcefully, showcasing the assertiveness of the punch.",
        "The body leans forward as the arm extends, delivering a punch that conveys urgency."
    ],
    "pushing other person": [
        "The hands press forward firmly against the other person, emphasizing intent and physicality in the push.",
        "With a swift motion, the body leans forward as hands connect, propelling the individual back.",
        "The torso shifts weight as both hands thrust outward, showcasing assertiveness in the push.",
        "The arm extends firmly, pushing against the other person to create distance and assert dominance.",
        "An engaging gesture occurs as the body leans in, hands connecting for a decisive push.",
        "The shoulders square off as both hands move forward, driving into the other person assertively.",
        "The body leans slightly, palms pressed outward to create an impactful push against the individual.",
        "With determination, the hands push against the other person, reinforcing the action’s intensity.",
        "A strong motion occurs as both arms thrust forward, demonstrating power in the push.",
        "The hand connects firmly with the person, demonstrating intent and force in the pushing action."
    ],
    "put on a hat/cap": [
        "The hands lift the hat upward, aligning it carefully above the head for placement.",
        "With a gentle motion, the cap is lowered onto the head, adjusting for comfort.",
        "The fingers guide the hat downwards, ensuring a secure fit atop the head.",
        "The body leans slightly forward as the hands position the cap firmly in place.",
        "With a smooth motion, the hat is lifted and adjusted on the head for style.",
        "The arm reaches up, placing the hat delicately on the head, highlighting personal style.",
        "As the cap is lowered, the fingers adjust the brim, ensuring a perfect fit.",
        "The head tilts slightly as the hands maneuver the hat onto the head snugly.",
        "The hands cradle the cap, placing it gently atop the head for a comfortable fit.",
        "With a quick motion, the hat is positioned above the head, emphasizing personal flair."
    ],
    "put something inside pocket": [
        "The hand reaches down, fingers curling around the item, smoothly sliding it into the pocket.",
        "With a swift motion, the object is dropped into the pocket, enhancing convenience and accessibility.",
        "The body leans slightly, allowing the hand to easily place the item into the pocket.",
        "The fingers grasp the item firmly before sliding it into the pocket for secure storage.",
        "With an engaging gesture, the hand lifts the object, depositing it into the pocket seamlessly.",
        "The arm bends as the hand navigates toward the pocket, placing the item inside carefully.",
        "An efficient motion occurs as the object is tucked securely into the pocket for safekeeping.",
        "With purpose, the fingers grasp the item and slide it into the pocket for convenience.",
        "The hand descends swiftly, depositing the object within the pocket for easy access later.",
        "The torso shifts slightly, allowing the hand to tuck the item securely into the pocket."
    ],
    "reading": [
        "The eyes focus intently on the text as hands hold the book open, enhancing comprehension.",
        "With a relaxed posture, the body leans forward slightly, fingers tracing the lines on the page.",
        "The head tilts downward as the eyes scan the words, conveying deep engagement in reading.",
        "The hands turn the pages gently, maintaining flow while the eyes absorb the written content.",
        "The body settles comfortably as fingers guide the text, eyes darting back and forth for clarity.",
        "With concentration, the eyes move across the lines, fingers positioned to turn the page easily.",
        "The arms rest comfortably while the book is held close, engaging the mind in reading.",
        "The torso leans in as the eyes track the text, hands supporting the book’s weight.",
        "The head tilts slightly as the reader immerses in the story, fingers lightly turning pages.",
        "The body relaxes while the fingers hold the book steady, eyes engaging with the text."
    ],
    "rub two hands together": [
        "The palms press together while fingers intertwine, generating warmth through friction.",
        "Fingers glide against each other, palms creating heat through a rhythmic rubbing motion.",
        "Hands are brought together, rubbing vigorously to create warmth and enhance tactile sensations.",
        "The fingers interlock as palms slide against each other, producing friction and warmth.",
        "Both hands come together, rubbing back and forth, generating warmth between the palms.",
        "The palms rub against each other, fingers moving in circular motions to create heat.",
        "Hands move in a back-and-forth motion, creating friction to generate warmth and energy.",
        "The palms touch and glide smoothly, creating a comforting sensation through friction and motion.",
        "Fingers intertwine while hands move together, creating warmth through a gentle, repetitive rubbing.",
        "Hands are rubbed together vigorously, palms pressing against each other to generate warmth."
    ],
    "salute": [
        "The hand rises to the forehead, palm facing inward, fingers extended in a formal greeting.",
        "The arm lifts sharply, hand positioned at the brow, showcasing respect and acknowledgment.",
        "With a swift motion, the hand moves up, fingers together, signaling a respectful greeting.",
        "The fingers touch the forehead briefly as the arm extends outward, conveying respect.",
        "A hand raises to the forehead, fingers aligned, signaling a formal gesture of salute.",
        "The arm lifts smoothly, hand positioned flat, showcasing a respectful gesture toward an individual.",
        "With a quick motion, the hand touches the brow, extending outward in salute.",
        "The palm touches the forehead, fingers pointing forward, representing a gesture of respect.",
        "The arm extends upward, palm facing forward, delivering a formal salute to another.",
        "The hand moves to the brow in a swift salute, expressing acknowledgment and respect."
    ],
    "sitting down": [
        "The body lowers gradually, legs bending at the knees, settling onto the surface below.",
        "The torso descends as knees bend, weight shifting backward until seated comfortably.",
        "The hips move back while bending the knees, allowing the body to settle into a chair.",
        "With a smooth motion, the legs bend, and the body lowers onto the seat.",
        "The knees flex, bringing the body downwards as it prepares to rest on the chair.",
        "The torso tilts forward slightly while the legs bend, guiding the body into a seated position.",
        "As the knees bend, the body shifts downward, finding balance on the seated surface.",
        "The hips shift back as the knees bend, easing the body down into a seated posture.",
        "The legs bend as the body descends gradually, settling into a comfortable sitting position.",
        "The body lowers while the knees bend, allowing a smooth transition into a seated stance."
    ],
    "standing up": [
        "The body straightens as legs extend, pushing upward into an upright position from sitting.",
        "With a swift motion, the knees extend, raising the body up from its seated position.",
        "The torso rises as legs straighten, shifting weight upward to transition into standing.",
        "The hips engage while legs push down, lifting the body smoothly into a standing position.",
        "The knees extend fully, elevating the body as it transitions from sitting to standing.",
        "The body rises gradually, legs extending and torso aligning to achieve an upright posture.",
        "As the torso straightens, legs extend forcefully, lifting the body into a standing position.",
        "The legs straighten while the body pushes upward, transitioning smoothly into a standing stance.",
        "With a firm motion, the knees extend, elevating the body from a seated position.",
        "The hips engage while the legs push downward, lifting the body into an upright stance."
    ],
    "take off a hat/cap": [
        "The hands grasp the brim, lifting the hat upward away from the head smoothly.",
        "The fingers curl around the cap, gently lifting it off while the head tilts slightly.",
        "The hands grasp the sides of the hat, elevating it upward and away from the head.",
        "With a swift motion, the hat is lifted off the head using both hands.",
        "The fingers grip the hat firmly, pulling it off the head while the torso leans slightly.",
        "The hands rise above the head, gently removing the hat with a fluid motion.",
        "As the hat is lifted, the body tilts slightly forward, ensuring a smooth removal.",
        "The fingers grasp the brim tightly, elevating the hat from the head with precision.",
        "The cap is pulled upward using both hands, allowing the head to be uncovered smoothly.",
        "With a gentle lift, the hat is removed, fingers guiding it away from the head."
    ],
    "take off glasses": [
        "The fingers grasp the frames, gently sliding the glasses off the face in one motion.",
        "With both hands, the frames are pinched, pulling the glasses away from the eyes smoothly.",
        "The hands reach up, fingers curling around the temples to remove the glasses effortlessly.",
        "The glasses are lifted from the face as fingers slide along the arms, revealing clear vision.",
        "As fingers grip the frames, the glasses are pulled away from the eyes with care.",
        "The hands move to the sides, lifting the glasses off the face with a fluid motion.",
        "The arms raise slightly, fingers grasping the frames to slide the glasses off smoothly.",
        "With a swift motion, the hands remove the glasses, fingers gripping the arms gently.",
        "The glasses are carefully lifted from the face, fingers sliding along the frames effortlessly.",
        "The hands move towards the face, fingers grasping the glasses before removing them smoothly."
    ],
    "take off jacket": [
        "The hands grasp the jacket sleeves, pulling them downward while the torso leans back slightly.",
        "With a swift motion, the arms pull the jacket off the shoulders, revealing the shirt beneath.",
        "The body leans slightly forward as hands remove the jacket, sliding it off each arm.",
        "Fingers grasp the collar, pulling the jacket down smoothly while the body shifts slightly.",
        "As the arms move backward, the jacket is pulled off, freeing the upper body comfortably.",
        "The torso leans back as hands grip the jacket, sliding it off the shoulders with ease.",
        "With deliberate motion, the hands pull the sleeves off, lowering the jacket to the waist.",
        "The arms extend outward, gently removing the jacket from the shoulders, showcasing ease of motion.",
        "The hands grip the sleeves firmly, sliding the jacket off smoothly, revealing the outfit underneath.",
        "With fluidity, the arms pull the jacket off, allowing the body to breathe freely afterward."
    ],
    "take out something from pocket": [
        "The fingers dip into the pocket, retrieving the item while the body stands upright.",
        "With a swift motion, the hand plunges into the pocket, grasping the object firmly.",
        "The hand reaches into the pocket, fingers curling around the item, lifting it out carefully.",
        "The body shifts slightly as the hand reaches down, retrieving the object from the pocket.",
        "The fingers navigate inside the pocket, grasping the item firmly before withdrawing it smoothly.",
        "With precision, the hand retrieves the object from the pocket, showcasing fluidity in motion.",
        "The arm bends slightly as the fingers curl around the item, pulling it out from the pocket.",
        "The hand delves into the pocket, fingers wrapping around the item before pulling it out gently.",
        "As the fingers locate the object, the hand lifts it from the pocket effortlessly.",
        "The body leans slightly as the hand reaches deep into the pocket, retrieving the item swiftly."
    ],
    "taking a selfie": [
        "The arm extends outward, holding the phone up while the fingers adjust the angle for the photo.",
        "With a quick motion, the body shifts slightly to frame the shot while the arm lifts.",
        "The phone is held at arm's length, fingers tapping the screen to capture the moment.",
        "The body angles slightly as the arm extends, capturing a candid moment with a smile.",
        "With a confident pose, the hand holds the phone up, capturing the scene in front.",
        "The fingers press the button, while the other hand strikes a pose for the selfie.",
        "The body tilts slightly as the arm extends, framing the face perfectly for the selfie.",
        "With both hands, the phone is positioned, ensuring a flattering angle for the selfie.",
        "The arm lifts the phone high while the body angles slightly to capture the best view.",
        "The fingers press the shutter button as the arm extends, ensuring the perfect selfie moment."
    ],
    "tear up paper": [
        "The fingers grip the paper firmly, ripping it apart with controlled force as the body leans forward.",
        "With a swift motion, the hands pull the paper apart, showcasing a clear tear through the material.",
        "The hands grasp the edges of the paper, pulling apart to create uneven pieces effortlessly.",
        "As the fingers grip the paper's edge, a tearing motion unfolds, creating multiple fragments quickly.",
        "The body leans in slightly as the paper is ripped, showcasing strength through the tearing motion.",
        "The hands apply pressure to the edges, tearing the paper in a jagged motion with ease.",
        "With a deliberate gesture, the paper is ripped apart, fingers maintaining control throughout the action.",
        "The paper is grasped firmly, fingers pulling apart in a swift motion to create shreds.",
        "The fingers grip both sides of the paper, tearing it apart with a clean motion.",
        "The body shifts slightly forward as the paper is torn, emphasizing the force behind the action."
    ],
    "throw": [
        "Arm extends forward, hand releases the object into the air, body leans slightly.",
        "Fingers grip tightly, arm swings back then forward, releasing the ball energetically.",
        "The hand moves swiftly, flinging the object with an upward motion from the shoulder.",
        "With a quick motion, the arm launches the item forward, body twisting for power.",
        "The shoulder rotates as the arm flicks outward, sending the object sailing away.",
        "A strong push from the wrist propels the item into the distance, body stable.",
        "The fingers release the object, arm extended fully, while the torso follows the motion.",
        "Hand flicks upward, arm extended, launching the item high into the air effortlessly.",
        "With forceful intent, the arm extends and the wrist snaps, throwing the ball away.",
        "Body shifts weight to the front foot as the arm swings, releasing the object."
    ],
    "touch back (backache)": [
        "Fingers press gently against the lower back, body leans slightly to relieve discomfort.",
        "Palm rests firmly on the back, fingers splayed, easing tension while standing upright.",
        "Hands rub the lower back area, body tilting slightly to one side for relief.",
        "The fingers apply pressure to the back, body bends forward slightly to alleviate pain.",
        "One hand touches the back, fingers curling as the body adjusts posture for comfort.",
        "The palm presses into the back, fingers digging gently to soothe soreness while seated.",
        "With fingers digging in, the hand caresses the lower back while the body leans.",
        "The fingers explore the back area, massaging gently as the torso remains relaxed.",
        "Hands wrap around the waist, providing gentle pressure to relieve backache while standing.",
        "Fingers trace along the spine, applying light pressure to alleviate tension in the back."
    ],
    "touch chest (stomachache/heart pain)": [
        "Palm rests on the chest, fingers spread wide as the body leans slightly forward.",
        "Fingers press firmly into the chest area, body tilting back slightly to relieve discomfort.",
        "The hand lays flat against the chest, fingers curling gently, offering comfort while standing.",
        "With a gentle touch, the palm covers the chest, body relaxing to ease the pain.",
        "Fingers explore the chest area, providing soothing pressure while the body remains still.",
        "The hand presses gently into the chest, body stabilizing as a sigh escapes the lips.",
        "Fingers splay across the chest, pressing lightly as the body leans back for comfort.",
        "A firm grip on the chest offers relief, while the body shifts slightly to ease tension.",
        "The palm covers the chest area, fingers spreading to embrace the sensation of relief.",
        "With a gentle touch, the hand rests on the chest, body leaning slightly forward."
    ],
    "touch head (headache)": [
        "Fingers press gently against the temples, body tilting forward slightly to ease tension.",
        "Palm cradles the head, fingers splayed across the forehead as the body relaxes.",
        "The hand touches the forehead lightly, fingers spreading as the body finds comfort.",
        "With fingertips massaging the scalp, the head tilts back slightly to alleviate pain.",
        "Fingers press on the back of the head, body tilting slightly to relieve discomfort.",
        "The palm rests on the forehead, fingers gliding across the skin to soothe the ache.",
        "Hands cup the sides of the head, gently squeezing to alleviate the pulsating pain.",
        "The fingers run along the hairline, applying gentle pressure as the body relaxes.",
        "With a light touch, fingers explore the scalp, offering relief while the body stays still.",
        "The hand covers the forehead, fingers pressing gently as the body sinks into relaxation."
    ],
    "touch neck (neckache)": [
        "Fingers press gently against the neck, body tilting slightly to relieve tension in muscles.",
        "The palm rests on the side of the neck, fingers curling to massage the area.",
        "Hands explore the neck, applying pressure while the body leans forward for comfort.",
        "Fingers glide along the neck, massaging gently as the body remains upright and relaxed.",
        "The hand grips the back of the neck, fingers pressing to alleviate the strain.",
        "With fingertips tracing the neck's contours, the body shifts slightly to ease the ache.",
        "The palm rests firmly on the neck, fingers digging in to relieve discomfort while standing.",
        "Fingers apply pressure to the sides of the neck, easing tension as the body relaxes.",
        "With a gentle touch, the hand explores the neck area, promoting relaxation in the shoulders.",
        "Fingers rub the back of the neck, providing comfort as the body tilts slightly."
    ],
    "typing on a keyboard": [
        "Fingers move swiftly across the keyboard, palms resting lightly on the desk, body upright.",
        "Hands hover above the keys, fingers dancing swiftly while the body leans forward slightly.",
        "The fingers tap rhythmically on the keyboard, wrists straight as the body stays relaxed.",
        "With fingers poised, the hands glide over the keys, the body maintaining a steady posture.",
        "The palms rest on the keyboard while fingers type quickly, body leaning slightly forward.",
        "Fingers strike the keys rapidly, palms hovering lightly above as the body remains centered.",
        "With deliberate motions, fingers move across the keyboard, body positioned upright for efficiency.",
        "Hands float above the keyboard, fingers flying as the body shifts slightly for comfort.",
        "Fingers press down on the keys, palms steady, while the body remains relaxed and upright.",
        "Hands glide over the keyboard smoothly, fingers tapping rhythmically as the body stays engaged."
    ],
    "use a fan (with hand or paper)/feeling warm": [
        "The hand waves back and forth, fanning the air, body leaning slightly to catch a breeze.",
        "Fingers flutter a paper fan, the body tilting to enjoy the cool air it creates.",
        "With a swift motion, the hand moves the fan, body swaying gently to catch the airflow.",
        "The paper flutters in the air as fingers fan vigorously, body relaxed and enjoying the coolness.",
        "A hand moves swiftly to create a breeze, while the body tilts slightly for comfort.",
        "Fingers grip the fan tightly, waving it rapidly as the body seeks relief from heat.",
        "With quick movements, the hand fans air towards the face, body leaning in for a breeze.",
        "The hand moves a paper fan swiftly, body tilting slightly to embrace the cool air.",
        "Fingers flutter the fan, the body shifts back slightly to enjoy the refreshing sensation.",
        "The hand waves rapidly, creating a breeze as the body adjusts to the warm environment."
    ],
    "wear jacket": [
        "Hands slide into the sleeves, pulling the jacket over shoulders while the body straightens.",
        "Arms extend, slipping into the jacket, body shifting slightly to adjust for a comfortable fit.",
        "The body lifts the jacket overhead, arms threading through sleeves, settling onto the shoulders.",
        "Fingers grasp the collar, pulling the jacket onto the body as it settles comfortably.",
        "With both hands, the jacket is pulled on, the body tilting slightly for ease.",
        "The torso rotates while the arms slide into the sleeves, securing the jacket in place.",
        "Hands adjust the collar as the body straightens, ensuring the jacket fits snugly.",
        "The body leans slightly as the jacket is pulled over the shoulders, settling in place.",
        "Fingers smooth the fabric of the jacket, body upright as it is worn comfortably.",
        "The arms move gracefully into the sleeves, the body adjusting for a relaxed fit."
    ],
    "wear on glasses": [
        "Fingers grasp the frames, positioning the glasses carefully on the face while the body remains still.",
        "Hands lift the glasses toward the face, adjusting them gently as the body stays relaxed.",
        "With a firm grip, the frames are positioned on the nose, body poised for clarity.",
        "The glasses slide onto the face, fingers adjusting them while the body maintains an upright posture.",
        "The hands position the glasses carefully, fingers curling around the frames, body remaining steady.",
        "Fingers place the glasses on the bridge of the nose, body adjusting for a comfortable fit.",
        "The hand lifts the glasses, positioning them over the eyes while the body stands relaxed.",
        "With delicate movements, the glasses are placed on the face, fingers adjusting for comfort.",
        "Hands carefully position the frames on the face, body upright as the lenses settle in place.",
        "The glasses are positioned delicately on the face, fingers ensuring a snug fit while standing."
    ],
    "wipe face": [
        "Fingers glide across the face, gently wiping away sweat while the body remains upright.",
        "The palm presses lightly against the face, fingers smoothing over skin as the body leans forward.",
        "With a gentle motion, the hand wipes across the cheeks, body steady and relaxed.",
        "The fingers brush across the forehead, removing moisture as the body tilts slightly.",
        "Hands move gracefully to wipe the face, body remaining upright and poised throughout the motion.",
        "The palm glides over the skin, fingers lightly touching as the body remains stable.",
        "With a swift motion, the hand wipes the face, ensuring comfort as the body leans back.",
        "The fingers press gently against the cheeks, wiping away moisture while the body stays still.",
        "Hands move softly over the face, removing sweat as the body shifts slightly for ease.",
        "Fingers gently caress the face, wiping away beads of sweat while the body maintains balance."
    ],
    "writing": [
        "The hand grips the pen tightly, fingers moving smoothly across the paper, body slightly hunched.",
        "Fingers glide along the page, pen tracing letters as the body leans in concentration.",
        "The pen flows effortlessly, fingers dancing over the surface, body relaxed and focused.",
        "With delicate motions, the fingers move the pen, body upright as thoughts are translated to paper.",
        "The wrist pivots as the hand writes, fingers carefully forming letters while the body stays still.",
        "Fingers grip the pencil, writing swiftly as the body shifts slightly to maintain balance.",
        "The pen glides across the paper, fingers engaged as the body leans forward in focus.",
        "Hands hold the notebook steady, fingers flowing with the pen as the body remains poised.",
        "The fingers move quickly, pen tracing words while the body leans in for closer inspection.",
        "With swift strokes, the pen moves across the page, fingers engaged while the body stays upright."
    ]
}





